<html>
<head>
<style>
	body {
	background: #FFFFFF;
	color: #000000;
	}
</style>

</head>

<body>

<p align="center">
    <strong>CONTRAT DE LICENCE UTILISATEUR FINAL</strong>
</p>
<div>
    <p>
        <strong> </strong>
    </p>
</div>
<p>
    CE LOGICIEL EST LICENCI&#201; ET NON VENDU. SEGA Games Co., Ltd du 02/01/12, Haneda, Ohta-ku, Tokyo, 144-8531, Japon, et ses soci&#233;t&#233;s
    affili&#233;es (collectivement, &#171; <strong>SEGA</strong> &#187; ou &#171; <strong>Nous</strong> &#187;) se r&#233;servent tous les droits qui ne vous
    sont pas express&#233;ment accord&#233;s. Cette licence se r&#233;f&#232;re aux produits sous le nom de Logiciel de Jeu, &#201;diteurs, Contenu
    Additionnel, Mat&#233;riels Physiques et Code Cl&#233; (comme d&#233;finis ci-dessous), et collectivement sous le nom de &#171; <strong>Produits</strong>
    &#187;.
</p>
<div>
    <p>
        Si vous avez des questions concernant cet accord, vous pouvez joindre SEGA au 27 Great West Road, Brentford, Middlesex, TW8 9BW, Angleterre, &#224;
        l'attention du d&#233;partement juridique.
    </p>
</div>
<div>
    <p>
        <strong> </strong>
    </p>
    <p>
        Ceci est un accord l&#233;gal entre vous et SEGA. Veuillez consulter ce Contrat de Licence Utilisateur Final (&#171; <strong>Accord</strong> &#187;)
        avant d'installer, d&#8217;acc&#233;der &#224; ou d&#8217;utiliser le jeu que vous venez d&#8217;acheter (&#171; <strong>LOGICIEL DE JEU </strong>
        &#187;), le logiciel d&#8217;&#233;dition que vous venez de t&#233;l&#233;charger, toute partie du Logiciel de Jeu ou tout logiciel d'une tierce partie
        qui vous permet de cr&#233;er de nouvelles variations, des contenus, des variations, modifications, adaptations, copies, am&#233;liorations, etc. du
        Logiciel de Jeu (&#171; <strong>&#201;DITEURS</strong> &#187;), tout autre contenu disponible en t&#233;l&#233;chargement qu&#8217;il soit payant ou
        offert &#224; titre gratuit par SEGA (&#171; <strong>CONTENU </strong><strong>ADDITIONNEL</strong><strong> </strong>&#187;), l'emballage, les manuels
        imprim&#233;s et tout autre mat&#233;riel accompagnant le Logiciel de jeu, si applicables (&#171; les &#171; <strong>MAT&#201;RIELS PHYSIQUES </strong>
        &#187;) et les s&#233;quences alpha-num&#233;riques uniques qui sont imprim&#233;es dans le manuel et/ou les autres documents inclus dans les
        mat&#233;riels physiques ou vous parviennent par voie num&#233;rique lorsque vous l'activez via une plateforme tierce pour r&#233;cup&#233;rer,
        acc&#233;der, t&#233;l&#233;charger et utiliser le Logiciel de jeu (&#171; <strong>CODE CL&#201; </strong>&#187;). Le Logiciel de Jeu inclut tout
        logiciel inclus avec le jeu, les m&#233;dias associ&#233;s, toutes les mises &#224; jour et am&#233;liorations qui remplacent ou compl&#232;tent le
        logiciel qui ne sont pas distribu&#233;s avec une licence s&#233;par&#233;e, les m&#233;dias associ&#233;s, tout logiciel associ&#233; au mode en ligne
        du jeu vid&#233;o, tout contenu imprim&#233;, toute documentation &#233;lectronique ou consultable en ligne, et toutes les copies d&#8217;un tel
        logiciel ou de tels contenus.
    </p>
    <p>
        Veuillez vous renseigner sur ce que vous ne comprenez pas. SEGA demande que vous contactiez un des centres de service client&#232;le
        d&#233;taill&#233;s dans l&#8217;information qui accompagne un des Produits. Veuillez noter que l'appel donn&#233; au service client&#232;le peut vous
        &#234;tre factur&#233;.
    </p>
</div>
<p align="center">
    <strong> </strong>
</p>
<div>
    <p>
        <strong>IMPORTANT &#8211; &#192; LIRE ATTENTIVEMENT :</strong>
        EN INSTALLANT, OUVRANT, COPIANT ET/OU UTILISANT CE PRODUIT, VOUS CONC&#201;DEZ ET ACCEPTEZ D'&#202;TRE LI&#201; PAR LES TERMES DU PR&#201;SENT ACCORD.
L'ACCORD (Y COMPRIS TOUTES LES ANNEXES DE CET ACCORD), TEL QUE MODIFI&#201; DE TEMPS EN TEMPS ET PUBLI&#201; SUR<a href="http://www.sega.co.uk/legal/terms.php">http://www.sega.co.uk/legal/terms.php</a>, INT&#200;GRE LA POLITIQUE DE CONFIDENTIALIT&#201; DE SEGA<a name="OLE_LINK14"></a><a name="OLE_LINK15">(PUBLI&#201;E SUR </a>        <a href="http://www.sega.co.uk/legal/privacy.php">http://www.sega.co.uk/legal/privacy.php</a>). L'ACCORD S'APPLIQUE &#192; TOUS LES UTILISATEURS DU
        PRODUIT, Y COMPRIS LES UTILISATEURS QUI SONT &#201;GALEMENT CONTRIBUTEURS DU CONTENU, DES INFORMATIONS ET DES AUTRES MAT&#201;RIELS OU LOGICIELS. SI
        VOUS N'&#202;TES PAS D'ACCORD AVEC LES CONDITIONS DU PR&#201;SENT ACCORD, VOUS N'&#202;TES PAS AUTORIS&#201; &#192; INSTALLER, COPIER OU UTILISER LES
        PRODUITS. VOTRE RECOURS EN CAS D'INSATISFACTION AVEC LE PRODUIT OU TOUT AUTRE MAT&#201;RIEL OU INFORMATION RENDUS DISPONIBLES PAR SEGA OU LE BIAIS DE
        SEGA, EST D&#8217;ARR&#202;TER D&#8217;UTILISER CES PRODUITS. VOTRE ACCORD AVEC SEGA CONCERNANT LE RESPECT DES MODALIT&#201;S DE L&#8217;ACCORD PREND
        EFFET IMM&#201;DIATEMENT D&#200;S LE COMMENCEMENT DE L&#8217;UTILISATION DU PRODUIT. SI VOUS N'&#202;TES PAS D'ACCORD AVEC LES CONDITIONS PR&#201;VUES
        DANS LE PR&#201;SENT ACCORD, ne t&#233;l&#233;chargez pas ou n'utilisez pas le PRODUIT. SEGA ne vous accordera pas la Licence ET NE SERA PAS JUG&#201;
        APTE &#192; VOUS L'ACCORDER pour installer et utiliser les PRODUITS.
    </p>
</div>
<p>
    <strong> </strong>
</p>
<p>
    <strong>DROITS D'ANNULATION : </strong>
    CONTENU DIGITAL<strong> </strong>
</p>
<p>
    <strong> </strong>
</p>
<p>
    POUR TOUT ACHAT DE CONTENU NUM&#201;RIQUE (Y COMPRIS MAIS NE SE LIMITANT PAS AU LOGICIEL DE JEU, &#201;DITEURS, NOUVEAUX CONTENUS ET/OU CONTENU
    SUPPL&#201;MENTAIRE ET CODE CL&#201;), VOUS ACCEPTEZ QUE SEGA RENDE CES PRODUITS DISPONIBLES AU T&#201;L&#201;CHARGEMENT ET &#192; L'UTILISATION
    IMM&#201;DIATE APR&#200;S VALIDATION DE VOTRE COMMANDE, ET UNE FOIS RENDU DISPONIBLE, AUTANT QUE LE PERMET LA LOI, VOUS N'AUREZ PLUS LE DROIT D'ANNULER
    VOTRE COMMANDE OU &#192; UN D&#201;LAI DE R&#201;TRACTATION, ET VOUS NE POURREZ OBTENIR DE REMBOURSEMENT, SAUF INDICATION CONTRAIRE EXPLICITE DE NOTRE PART
    OU PAR UN TIERS VENDEUR.
</p>
<div>
</div>
<ol type="1" start="1">
    <li>
        <strong>Prise de connaissance et acceptation des conditions par l'utilisateur</strong>
    </li>
</ol>
<p>
    <strong> </strong>
</p>
<p>
    Le Produit est propos&#233; sous r&#233;serve de conformit&#233; avec tous les termes et conditions contenus ci-pr&#233;sents et toutes les autres
    r&#232;gles de fonctionnement, politiques et proc&#233;dures. De plus, certaines applications propos&#233;es par l'interm&#233;diaire ou en relation avec
    le Produit peuvent &#234;tre soumises &#224; des conditions suppl&#233;mentaires publi&#233;es par SEGA de temps &#224; autre. Toute modification
mat&#233;rielle de l'accord sera &#233;galement port&#233;e &#224; votre attention sur<a href="http://www.sega.co.uk/legal/terms.php">http://www.sega.co.uk/legal/terms.php</a> ou    <a href="http://www.sega.co.uk/legal/privacy.php">http://www.sega.co.uk/legal/privacy.php</a>. Ces modifications importantes seront en vigueur
    imm&#233;diatement et s'appliqueront aux diff&#233;rends d&#233;coulant de l'Accord depuis la date de publication. Votre utilisation continue du Produit
    apr&#232;s qu&#8217;une modification a &#233;t&#233; apport&#233;e &#224; l&#8217;Accord indique votre acceptation de cette modification.
</p>
<p>
    Les lois locales dans votre juridiction n&#233;cessitent un &#226;ge particulier afin de vous conformer &#224; certaines clauses l&#233;gales vous liant
    comme les termes de cet Accord.
</p>
<p>
    Si vous n'avez pas l'&#226;ge requis, vous ne pourrez pas continuer &#224; utiliser le Produit &#224; moins que l'un de vos parents ou que votre tuteur
    l&#233;gal n'ait lu et accept&#233; les termes. Certaines l&#233;gislations peuvent aussi exiger que les enfants en dessous d'un certain &#226;ge soient
    supervis&#233;s durant l'utilisation du Produit. En utilisant le Produit, vous garantissez que vous avez l'&#226;ge requis pour utiliser le Produit sans la
    supervision d'un adulte. Si vous n'avez pas atteint l'&#226;ge requis, votre parent ou tuteur l&#233;gal garantit qu'il ou elle supervisera et surveillera
    votre utilisation du Produit &#224; tout moment.
</p>
<p>
    Ce Produit n'est pas adapt&#233; aux enfants en dessous d'un certain &#226;ge. Lorsque cela est possible, SEGA indiquera un &#226;ge appropri&#233; en
    fonction du contenu du Produit exigeant un &#226;ge minimum. L'&#226;ge minimum n'est qu'une suggestion et SEGA n'est pas responsable dans le cas o&#249;
    vous jugeriez que le mat&#233;riel n'est pas appropri&#233; &#224; l'&#226;ge indiqu&#233;, en aucune circonstance. Veuillez noter que toutes les fonctions
    du Produit ne sont pas &#233;valu&#233;es et que certaines peuvent contenir du langage et du contenu adulte.
</p>
<ol type="1" start="2">
    <li>
        <strong>LICENCE D'UTILISATION LIMIT&#201;E </strong>
    </li>
</ol>
<p>
    <strong> </strong>
</p>
<p>
    Sous r&#233;serve de votre conformit&#233; avec les termes et conditions de l'Accord, SEGA vous conc&#232;de une licence et un droit non exclusifs,
    non-transf&#233;rables, limit&#233;s, enti&#232;rement r&#233;vocables d&#8217;installer et utiliser une (1) copie du Produit uniquement et exclusivement
    pour votre utilisation personnelle et non commerciale. Le pr&#233;sent Accord s'applique &#233;galement &#224; tout patch ou mise &#224; jour que vous
    pouvez obtenir pour un des Produits.
    <a name="OLE_LINK16">
        CONFORM&#201;MENT AUX DISPOSITIONS ICI STIPUL&#201;ES ET SANS AUCUNE INTENTION DE S&#8217;Y LIMITER, LA DUPLICATION, COPIE OU TOUTE FORME DE
        REPRODUCTION DU PRODUIT OU DES INFORMATIONS OU CONTENUS RELATIFS SUR UN AUTRE SERVEUR OU ENDROIT &#192; DES FINS DE TOUTE AUTRE FORME DE REPRODUCTION
        OU DE DISTRIBUTION EST EXPRESS&#201;MENT ET EXPLICITEMENT INTERDITE.
    </a>
    Tous les droits non express&#233;ment accord&#233;s en vertu du pr&#233;sent Accord sont r&#233;serv&#233;s par SEGAet, le cas &#233;ch&#233;ant, par ses
    conc&#233;dants de licence.
</p>
<p>
    Vous ne pouvez pas causer ou permettre la vente, la distribution commerciale ou l'exploitation commerciale (par exemple, la location, la licence,
    sous-cession, de location, de diffusion, de t&#233;l&#233;charger ou de transmettre, bas&#233;s sur du P2P ou non) du Produit (ou d'une de ses parties)
    sans avoir obtenu au pr&#233;alable le consentement &#233;crit d'un repr&#233;sentant autoris&#233; de SEGA.
</p>
<ol type="1" start="3">
    <li>
        <strong>AUCUN DROIT DE PROPRI&#201;T&#201;</strong>
    </li>
</ol>
<p>
    <strong> </strong>
</p>
<p>
    VOUS RECONNAISSEZ N&#8217;AVOIR AUCUNE PROPRI&#201;T&#201; OU AUTRE INT&#201;R&#202;T DE PROPRI&#201;T&#201; DU PRODUIT ET DE PLUS, VOUS ACCEPTEZ QUE TOUS
    CES DROITS APPARTIENNENT, APPARTIENDRONT TOUJOURS ET S'APPLIQUERONT AU PROFIT DE SEGA. Sauf dans les cas qui vous sont ici express&#233;ment
    autoris&#233;s, tout droit, titre et int&#233;r&#234;t dans et pour le Produit et les droits d'auteur associ&#233;s, les marques et propri&#233;t&#233;s
    intellectuelles ci-incluses et/ou s'y rapportant et toutes les copies de celui-ci (y compris, mais sans s'y limiter, tous les patchs, mises &#224; jour,
    copies, les &#339;uvres d&#233;riv&#233;es, titres, codes informatiques, th&#232;mes, objets, personnages, noms de personnages, d'histoires, dialogues,
    slogans, lieux, concepts, illustrations, images, animations, sons, compositions musicales, effets audio-visuels , textes, m&#233;thodes de fonctionnement,
    droits moraux, &#171; applets &#187; incorpor&#233;s dans le Produit et dans toute documentation connexe) sont la propri&#233;t&#233; de SEGA ou des
    conc&#233;dants de licence de SEGA.
</p>
<p>
    Le Produit est prot&#233;g&#233; par les lois du d&#233;p&#244;t l&#233;gal du Royaume-Uni, les trait&#233;s internationaux et les conventions sur le
    d&#233;p&#244;t l&#233;gal et les autres lois. Tous droits r&#233;serv&#233;s. Le Produit comprend certains &#233;l&#233;ments sous licence, et SEGA et les
    conc&#233;dants de SEGA peuvent prot&#233;ger leurs droits dans le cas de toute violation du pr&#233;sent Accord.
</p>
<p>
    Cette licence ne vous accorde aucun titre ou propri&#233;t&#233; du Produit et ne devrait pas &#234;tre consid&#233;r&#233;e comme une vente ou un
    transfert des droits de propri&#233;t&#233; intellectuelle du Produit.
</p>
<ol type="1" start="4">
    <li>
        <strong>Aucune vente ni cession</strong>
    </li>
</ol>
<p>
    SEGA ne reconna&#238;t pas le transfert du Produit et par souci de clart&#233;, cela inclut le transfert s&#233;par&#233; de tout composant individuel du
    Produit (y compris le Logiciel de jeu, les &#201;diteurs, le Contenu additionnel, les Mat&#233;riels physiques et le Code cl&#233;). Par cons&#233;quent,
    vous ne pouvez pas donner, acheter, vendre, n&#233;gocier, troquer, mettre sur le march&#233;, offrir &#224; la vente, licencier, assigner ou encore
    c&#233;der vos droits, responsabilit&#233;s ou obligations en vertu de l'Accord, en totalit&#233; ou en partie, sans le consentement pr&#233;alable
    &#233;crit de SEGA. Toute tentative sera nulle et sans effet.
</p>
<ol type="1" start="5">
    <li>
        <strong>MAT&#201;RIEL G&#201;N&#201;R&#201; PAR L'UTILISATEUR</strong>
    </li>
</ol>
<p>
    Les &#201;diteurs qui vous sont fournis pour utiliser avec ce Logiciel de Jeu permettent de synchroniser le contenur audio, visuel et audio-visuel que vous
    avez cr&#233;&#233; (&#171; <strong>Contenu g&#233;n&#233;r&#233; par l'utilisateur</strong> &#187;) avec le Logiciel de jeu et/ou du contenu audio-visuel
    reproduit par le Logiciel de jeu (&#171; Captures en jeu &#187;).
</p>
<p>
    SEGA reconna&#238;t et accepte que tous les droits, titres et int&#233;r&#234;ts dans le contenu g&#233;n&#233;r&#233; par l'utilisateur (sauf les Logiciel
    de Jeu ou les Captures de Jeu) vous appartiennent. Dans la mesure requise par SEGA, &#224; l'&#233;gard du Contenu g&#233;n&#233;r&#233; par l'utilisateur,
    vous accordez automatiquement &#224; SEGA le droit irr&#233;vocable, perp&#233;tuel, libre de droits, de droit de sous-licence et de licence en vertu de
    tous les droits d&#8217;auteurs et les lois sur les droits de propri&#233;t&#233; intellectuelle applicables, d'utiliser, de reproduire, de modifier,
    d&#8217;adapter, d&#8217;ex&#233;cuter, d&#8217;afficher, de distribuer et d&#8217;exploiter autrement et/ou d&#8217;&#233;liminer les Nouveaux contenus
    (ou une partie des Nouveaux contenus) de quelque mani&#232;re que SEGA juge opportun.
</p>
<p>
    SEGA vous accorde par le pr&#233;sent contrat le droit non-exclusif, non-transf&#233;rable, limit&#233;, enti&#232;rement r&#233;vocable d'utiliser le
    Logiciel de Jeu ou Captures de Jeu avec votre Contenu g&#233;n&#233;r&#233; par l'utilisateur, selon les termes et conditions de ce Contrat et de toute
    autre politique publi&#233;e par SEGA de temps &#224; autre. La licence qui vous est accord&#233;e vous permet de synchroniser le Logiciel de Jeu et les
    Captures de Jeu avec votre Contenu g&#233;n&#233;r&#233; par l'utilisateur mais ne vous donne aucun droit de (a) revendre le Logiciel de Jeu ou les
    Captures de Jeu ; (b) distribuer ou diffuser en public le Logiciel de Jeu et les Captures de Jeu sans autorisation expresse dans ce document ou autre
    politique publi&#233;e par SEGA ; (c) de modifier ou de faire une utilisation d&#233;riv&#233;e du Logiciel de Jeu et des Captures de Jeu, ou de toute
    partie, pour toute autre raison. Vous reconnaissez et acceptez que tous les droits, titres et int&#233;r&#234;ts li&#233;s au Logiciel de Jeu et aux
    Captures de Jeu dans toute partie du monde, enregistr&#233;e ou non, enregistrable ou non, dans sa totalit&#233; ainsi que dans ses extensions et
    renouvellements, appartiennent et b&#233;n&#233;ficient &#224; SEGA, et resteront en notre propri&#233;t&#233; ou celle de nos filiales.
</p>
<p>
    Vous garantissez par la pr&#233;sente que les Contenus g&#233;n&#233;r&#233;s par l'utilisateur que vous synchronisez avec le Logiciel de jeu et/ou les
    Captures en jeu ne sont pas discriminatoires, racistes, obsc&#232;nes, offensants, ill&#233;gaux, diffamatoires, inappropri&#233;s, irrespectueux, ou de
    nature &#224; porter atteinte &#224; la r&#233;putation ou au fonds commercial de SEGA.
</p>
<p>
    Vous garantissez par la pr&#233;sente que les Contenus g&#233;n&#233;r&#233;s par l'utilisateur que vous synchronisez avec le Logiciel de jeu et/ou les
    Captures en jeu et l'utilisation ult&#233;rieure ainsi que l'exploitation de ces mat&#233;riaux par SEGA ou par vous ne porteront pas atteinte aux droits
    de toute personne (morale ou physique), n'aboutiront &#224; aucune responsabilit&#233; &#233;ventuelle de SEGA et ne seront pas utilis&#233;s pour quelque
    exploitation commerciale de votre part (par P2P ou tout service de partage ou autre) &#224; moins de disposer de l'autorisation explicite de SEGA.
</p>
<p>
    SEGA peut &#224; son enti&#232;re discr&#233;tion activer une fonction du Produit vous rendant disponibles des fichiers texte du Produit. SEGA vous octroie
    par la pr&#233;sente une permission limit&#233;e de produire des traductions communautaires du contenu textuel du Produit, tels que des commentaires de jeu
    et des instructions de jeu, et ce uniquement dans des langues autres que celles que le Produit propose d&#233;j&#224; (&#171; Traductions communautaires
    &#187;), dans le but de jouer au Produit pour un usage personnel. Vous pouvez publier les Traductions Communautaires que vous faites sur les forums du
    Produit ou sur la page du Produit sur Steam Workshop afin de partager ces Traductions Communautaires avec d'autres utilisateurs. Les Traductions
    Communautaires sont consid&#233;r&#233;es comme du Contenu g&#233;n&#233;r&#233; par l'utilisateur. Le d&#233;p&#244;t l&#233;gal dans les fichiers texte
    originaux sous-jacents et le texte qu'ils contiennent demeurent la propri&#233;t&#233; de SEGA &#224; tout moment.
</p>
<ol type="1" start="6">
    <li>
        <strong>CONDITIONS DE LA LICENCE </strong>
    </li>
</ol>
<p>
    <strong> </strong>
</p>
<p>
    Vous acceptez d'utiliser uniquement le Produit, ou toute partie de celui-ci, d'une mani&#232;re compatible avec le pr&#233;sent Accord, et vous NE POUVEZ
    PAS :
</p>
<p>
    (a) exploiter le Produit ou l'un de ses composants dans le commerce, y compris, mais sans s'y limiter, les cyber-caf&#233;s, salles d&#8217;arcade ou tout
    autre lieu physique ;
</p>
<p>
    (b) utiliser le Produit ou permettre l'utilisation du Produit, sur plus d'un ordinateur, console de jeu, appareil mobile, appareil portable ou PDA en
    m&#234;me temps, &#224; moins d'avoir l'autorisation expresse de SEGA ;
</p>
<p>
    (c) utiliser le Produit, permettre l'utilisation du Produit ou le rendre disponible pour une utilisation en r&#233;seau, un arrangement multi-utilisateur,
    un arrangement d'acc&#232;s &#224; distance, y compris l&#224; o&#249; il pourrait &#234;tre t&#233;l&#233;charg&#233; par des utilisateurs multiples ;
</p>
<p>
    (d) vendre, louer, pr&#234;ter, licencier, distribuer ou encore transf&#233;rer ce Produit ou toute copie ;
</p>
<p>
    (e) faire de l'ing&#233;nierie inverse, obtenir le code d'origine, modifier, d&#233;compiler, d&#233;sassembler, copier ou cr&#233;er des &#339;uvres
    d&#233;riv&#233;es du Produit, en tout ou en partie (autre que dans le cadre des Traductions Communautaires d&#233;crites pr&#233;c&#233;demment dans la
    Section 5) ;
</p>
<p>
    (f) supprimer, d&#233;sactiver ou contourner toutes les protections de s&#233;curit&#233;, les avis de propri&#233;t&#233; ou des &#233;tiquettes figurant
    sur ou dans le Produit, y compris mais sans s'y limiter, s&#233;parer le Code cl&#233; des Mat&#233;riels physiques inclus dans le Produit ;
</p>
<p>
    (g) exporter ou r&#233;-exporter le Produit ou toute copie ou adaptation en violation de toute r&#233;glementation ou loi applicable ;
</p>
<p>
    (h) cr&#233;er des donn&#233;es ou des programmes ex&#233;cutables qui imitent les donn&#233;es ou les fonctionnalit&#233;s dans le Produit, &#224; moins
    que cela vous soit fourni dans les &#201;diteurs.
</p>
<p>
    Si vous commettez une violation de cet Accord, votre droit d'utiliser le Produit en vertu du pr&#233;sent Accord sera automatiquement r&#233;sili&#233;,
    sans pr&#233;avis. Votre violation du pr&#233;sent paragraphe constitue une violation substantielle du pr&#233;sent Accord et / ou du droit d'auteur et
    d'autres lois de propri&#233;t&#233; intellectuelle en vigueur et des trait&#233;s, et peut engager votre responsabilit&#233; civile et p&#233;nale.
</p>
<p>
    De plus, vous convenez que vous devrez respecter les informations de s&#233;curit&#233;, les instructions d'entretien ou toute autre mention applicable
    contenue dans le manuel ou toute autre documentation fournie avec les Produits.
</p>
<ol type="1" start="7">
    <li>
        <strong>EXCLUSION DE GARANTIE, LIMITATION DE RESPONSABILIT&#201;</strong>
    </li>
</ol>
<p>
    <strong> </strong>
</p>
<p>
    DANS LA MESURE AUTORIS&#201;E PAR LA LOI EN VIGUEUR, VOUS ACCEPTEZ EXPRESS&#201;MENT QUE L'UTILISATION DU PRODUIT SOIT &#192; VOS PROPRES RISQUES ET QUE LA
    TOTALIT&#201; DES RISQUES CONCERNANT LA QUALIT&#201;, LA PERFORMANCE, LA PR&#201;CISION ET L'EFFORT SOIT DE VOTRE RESPONSABILIT&#201;. SAUF EN RELATION
    AVEC LA GARANTIE LIMIT&#201;E PROPOS&#201;E PAR SEGA DANS LA SECTION 14 DE CET ACCORD,ET DANS LES LIMITES AUTORIS&#201;ES PAR LA LOI EN VIGUEUR, LE PRODUIT
    VOUS EST FOURNI &#171; EN L'&#201;TAT &#187; ET &#171; SELON DISPONIBILIT&#201; &#187; AVEC TOUS SES D&#201;FAUTS ET SANS GARANTIE D'AUCUNE SORTE, ET SEGA
    EXCLUT TOUTE GARANTIE ET CONDITION EN CE QUI CONCERNE LE PRODUIT, QUE CE SOIT EXPRESSE OU IMPLICITE, Y COMPRIS, MAIS SANS S'Y LIMITER, LES GARANTIES
    IMPLICITES DE QUALIT&#201; MARCHANDE, DE QUALIT&#201; SATISFAISANTE, D'ADAPTATION &#192; UN USAGE PARTICULIER, D'EXACTITUDE, D&#8217;AMUSEMENT DISCRET ET
    DE NON-VIOLATION DES DROITS DE TIERS. SANS LIMITATION AUX POINTS PR&#201;C&#201;DEN TS, NOUS NE DONNONS AUCUNE GARANTIE QUE (A) LE PRODUIT R&#201;POND
    &#192; VOS ATTENTES, (B) QUE LE PRODUIT SERA SANS INTERRUPTION, OPPORTUN, S&#201;CURIS&#201; OU SANS ERREUR, (C) QUE LE PRODUIT SERA INTEROP&#201;RABLE OU
    COMPATIBLE AVEC D'AUTRES LOGICIELS OU (D) QUE LES R&#201;SULTATS QUI PEUVENT &#202;TRE OBTENUS PAR L'UTILISATION DU PRODUIT SERONT EFFECTIFS, PR&#201;CIS
    ET FIABLES. AUCUNE INFORMATION ORALE OU &#201;CRITE ET AUCUN CONSEIL DONN&#201; PAR SEGA OU SON/SES REPR&#201;SENTANT(S) AUTORIS&#201;(S) NE CONSTITUE DE
    GARANTIE.
</p>
<p>
    &#192; TOUT MOMENT, LE PRODUIT PEUT DEVENIR OBSOL&#200;TE ET SEGA NE S'ENGAGE PAS &#192; LE METTRE &#192; JOUR. LES EXCLUSIONS DE RESPONSABILIT&#201;
    CONTENUES DANS CETTE SECTION S'APPLIQUENT &#192; TOUT DOMMAGE OU PR&#201;JUDICE ATTRIBUABLE &#192; UN D&#201;FAUT D'EX&#201;CUTION, UNE ERREUR, OMISSION,
    INTERRUPTION, SUPPRESSION, EFFACEMENT, RETARD DE FONCTIONNEMENT OU DE TRANSMISSION, VIRUS INFORMATIQUE, PANNE DE COMMUNICATION, VOL OU DESTRUCTION OU
    ACC&#200;S NON AUTORIS&#201;, MODIFICATION OU UTILISATION DU PRODUIT, QUE CE SOIT POUR RUPTURE DE CONTRAT, COMPORTEMENT D&#201;LICTUEL, N&#201;GLIGENCE, OU
    EN VERTU DE TOUTE AUTRE ACTION. L'UTILISATION DU PRODUIT OU L'ACQUISITION DE T&#201;L&#201;CHARGEMENT OU DE TOUT AUTRE DOCUMENT PAR OU EN RELATION AVEC LE
    PRODUIT EST FAIT &#192; VOTRE PROPRE DISCR&#201;TION ET RISQUE, ET AVEC L&#8217;ACCORD QUE VOUS SEREZ SEUL RESPONSABLE DE TOUT D&#201;G&#194;T SUBI PAR
    VOTRE SYST&#200;ME INFORMATIQUE OU PERTE DE R&#201;SULTATS DE DONN&#201;ES EN RAISON DE CES ACTIVIT&#201;S.
</p>
<p>
    SEGA D&#201;CLINE TOUTE RESPONSABLIT&#201; QUANT &#192; LA PERTINENCE DES INFORMATIONS CONTENUES DANS LE PRODUIT, LES INFORMATIONS ET/OU LES GRAPHISMES
    PUBLI&#201;S DANS LE CADRE DU PRODUIT POUR TOUT USAGE. LE PRODUIT, LES INFORMATIONS ET GRAPHISMES CONNEXES PUBLI&#201;S DANS LE CADRE DU PRODUIT PEUVENT
    CONTENIR DES ERREURS TECHNIQUES OU DES ERREURS TYPOGRAPHIQUES. Vous comprenez et acceptez que des interruptions temporaires du produit puissent se produire
    comme des &#233;v&#233;nements normaux. Vous comprenez et acceptez que nous n'avons aucun contr&#244;le sur les r&#233;seaux tiers auxquels vous pourriez
    acc&#233;der dans le cadre de l'utilisation du produit, et donc, que les retards et les perturbations des transmissions de r&#233;seau sont
    enti&#232;rement hors du contr&#244;le de SEGA.
</p>
<p>
    VOUS ACCEPTEZ QUE VOTRE SEUL RECOURS EN CAS DE LITIGE AVEC SEGA SOIT DE CESSER D'UTILISER LE PRODUIT. EN AUCUN CAS LA RESPONSABILIT&#201; DE SEGA ENVERS
    VOUS N&#8217;EXC&#201;DERA LE MONTANT QUE VOUS AVEZ PAY&#201; &#192; SEGA OU SES FILIALES ET/OU D&#201;L&#201;GU&#201;S POUR LE PRODUIT APPLICABLE DONNANT
    LIEU &#192; UNE TELLE RESPONSABILIT&#201;. EN AUCUN CAS SEGA OU SES FILIALES NE SONT RESPONSABLES ENVERS VOUS OU UN TIERS DES DOMMAGES SP&#201;CIAUX,
    PUNITIFS, CONTINGENTS, INDIRECTS OU COLLAT&#201;RAUX DE QUELQUE NATURE QUE CE SOIT, OU DE TOUT DOMMAGE QUE CE SOIT, Y COMPRIS, MAIS SANS S'Y LIMITER, CEUX
    R&#201;SULTANT DE LA PERTE D'UTILISATION, DE DONN&#201;ES OU DE PROFITS, QUE NOUS AYONS &#201;T&#201; AVERTIS OU PAS DE LA POSSIBILIT&#201; DE TELS
    DOMMAGES ET LA TH&#201;ORIE DE RESPONSABILIT&#201;, PROVENANT DE OU EN RELATION AVEC L'UTILISATION DU PRODUIT, Y COMPRIS LES DOMMAGES AUX BIENS, LA PERTE
    DE FONDS DE COMMERCE, LA PANNE OU LE DYSFONCTIONNEMENT INFORMATIQUE ET, DANS LA MESURE PR&#201;VUE PAR LA LOI, LES DOMMAGES POUR BLESSURES PERSONNELLES,
    M&#202;ME SI SEGA A &#201;T&#201; INFORM&#201; DE LA POSSIBILIT&#201; DE TELS DOMMAGES.
</p>
<p>
    PARCE QUE CERTAINS &#201;TATS OU JURIDICTIONS NE PERMETTENT PAS L'EXCLUSION OU LA LIMITATION DE RESPONSABILIT&#201; POUR DOMMAGES DIRECTS OU INDIRECTS,
    DANS CES PAYS OU JURIDICTIONS, LA RESPONSABILIT&#201; DE SEGA ET DES AFFILI&#201;S DE SEGA SERA LIMIT&#201;E DANS TOUTE MESURE PR&#201;VUE PAR LA LOI.
</p>
<ol type="1" start="8">
    <li>
        <strong>Indemnisation</strong>
    </li>
</ol>
<p>
    Selon requ&#234;te de SEGA, vous acceptez de d&#233;fendre, indemniser et ne pas impliquer SEGA et ses affili&#233;s dans toute responsabilit&#233;,
    demande, perte, co&#251;ts et d&#233;penses, y compris les frais d'avocats, qui pourraient subvenir suite &#224; (a) votre utilisation, ou vos
    activit&#233;s li&#233;es au Produit (y compris, mais sans s'y limiter, la cr&#233;ation et l'utilisation de contenu g&#233;n&#233;r&#233; par
    l'utilisateur, qui est synchronis&#233; avec le Logiciel de Jeu et/ou les Captures du Jeu ; (b) toute violation de cet accord de votre part ; (c) toute
    all&#233;gation que tout contenu que vous rendez disponible via le produit enfreint ou autrement viole le d&#233;p&#244;t l&#233;gal, la marque
    commerciale, le secret commercial, la confidentialit&#233; ou les autres droits de la propri&#233;t&#233; intellectuelle ou autre de tout parti tiers. SEGA
    se r&#233;serve le droit, &#224; ses propres frais, d'assumer la d&#233;fense exclusive et le contr&#244;le de toute affaire autrement sujette &#224;
    indemnisation par Vous, auquel cas vous devrez coop&#233;rer avec SEGA en affirmant toutes les d&#233;fenses disponibles.
</p>
<ol type="1" start="9">
    <li>
        <strong>Courriels, messagerie, blogs et chat</strong>
    </li>
</ol>
<p>
    <strong> </strong>
</p>
<p>
    SEGA peut utiliser les e-mails, la messagerie, les blogs, ou le chat (collectivement, &#171; <strong>Logiciel de Communication</strong> &#187;) disponibles
    via le Produit, soit directement, soit par un fournisseur tiers. SEGA n'est pas responsable des communications d'autres utilisateurs via le Logiciel de
    Communication. Nous ne sommes pas responsables des communications faites par Vous via le Logiciel de Communication. Vous reconnaissez et acceptez que vos
    communications effectu&#233;es via le Logiciel de Communication soient publiques et non priv&#233;es et que vous renoncez &#224; toute attente de vie
    priv&#233;e en utilisant le Logiciel de Communication. Vous reconnaissez et acceptez que les renseignements personnels que vous partagez via le logiciel de
    communication puissent &#234;tre vus et utilis&#233;s par d'autres et puissent aboutir &#224; une distribution g&#233;n&#233;ralis&#233;e de ces
    informations. Nous vous encourageons fortement &#224; ne divulguer aucune information personnelle dans vos communications publiques par
    l'interm&#233;diaire du Logiciel de Communication, sauf si vous souhaitez que ces informations soient mises &#224; la disposition du public de fa&#231;on
    permanente.
</p>
<p>
    SEGA peut fournir des liens vers d'autres sites web tiers ou des ressources par le biais du Produit, soit directement soit pas le biais d'un fournisseur
    tiers. SEGA ne repr&#233;sente en aucun cas les autres sites web auxquels vous acc&#233;derez. Parce que SEGA n'a aucun contr&#244;le sur de tels sites et
    ressources, vous consentez &#224; ce que SEGA ne soit pas tenu responsable de la disponibilit&#233; de tels sites ou ressources externes, et ne soit pas
    tenu responsable de tout contenu, publicit&#233;, produit, service ou autre mat&#233;riel inclus ou disponible depuis de tels sites ou ressources, que vous
    acc&#233;dez &#224; ces sites web &#224; vos propres risques. Les r&#233;f&#233;rences &#224; des noms, marques, produits ou services tiers ou les liens
    hypertextes vers de sites tiers ou les informations vous sont uniquement fournis &#224; votre convenance, et ne constitue ou n'implique aucun soutien,
    sponsor ou recommandation d'un tiers ou de ses affiliations, ses produits et ses services. SEGA ne fait aucune repr&#233;sentation ou garantie des
    contenus, produits ou services tiers, et vous consentez &#224; ce que SEGA ne soit pas tenu responsable, directement ou indirectement, pour tout
    d&#233;g&#226;t ou perte caus&#233; ou pr&#233;tendument caus&#233; par ou en rapport avec l'utilisation directe ou indirecte de tels contenus, produits ou
    services tiers, inclus ou disponibles depuis de tels sites ou ressources.
</p>
<ol>
    <li>
        <p>
            <strong>UTILISATION INTERNATIONALE</strong>
        </p>
        <p>
            <strong> </strong>
        </p>
        <p>
            Bien que le Produit soit accessible mondialement, nous ne garantissons pas que ce Produit ou les mat&#233;riaux li&#233;s soient appropri&#233;s ou
            disponibles &#224; l'utilisation dans votre territoire, et il n'est pas garanti que vous ayez acc&#232;s au Produit &#224; partir de territoires
            dans lesquels le contenu est ill&#233;gal. Ceux qui choisissent d'acc&#233;der au Produit &#224; partir de ces territoires le font de leur propre
            initiative et sont responsables du respect des lois locales, si et dans la mesure o&#249; les lois locales sont applicables. Toute offre et/ou
            information mise en relation avec le Produit est nulle l&#224; o&#249; le Produit est interdit.
            <strong>
                Sans limiter ce qui pr&#233;c&#232;de, les Produits ne peuvent &#234;tre export&#233;s ou r&#233;export&#233;s (a) dans (ou &#224; un
                r&#233;sident national de) tout pays sous embargo des &#201;tats-Unis ou (b) &#224; toute personne sur la liste des &#171; Ressortissants
                sp&#233;cifiquement d&#233;sign&#233;s &#187; du minist&#232;re des Finances des &#201;tats-Unis ou de la liste des personnes ou des
                entit&#233;s refus&#233;es, ou autrement d&#233;sign&#233;es comme interdites. En acc&#233;dant &#224; et en utilisant les Produits, vous
                d&#233;clarez et garantissez que vous n'&#234;tes pas ressortissant ou r&#233;sident de, situ&#233; dans ou sous le contr&#244;le d'un pays
                mentionn&#233; sur une telle liste.
            </strong>
        </p>
    </li>
</ol>
<ol type="1" start="11">
    <li>
        <strong>R&#201;SILIATION ET P&#201;RENNIT&#201; DES TERMES</strong>
    </li>
</ol>
<p>
    <strong> </strong>
</p>
<p>
    L&#8217;Accord stipul&#233; ci-inclus demeure en vigueur tant qu&#8217;une des parties n&#8217;y met pas un terme. Vous acceptez et convenez que vous
    n&#8217;&#234;tes pas en droit de recevoir quelconque remboursement pour tous les montants qui auraient &#233;t&#233; pay&#233;s &#224; SEGA avant toute
    r&#233;siliation. Vous conservez l&#8217;enti&#232;re discr&#233;tion pour arr&#234;ter l&#8217;utilisation du Produit &#224; tout moment, en vertu des
    termes de cet Accord. Sans pr&#233;judice des autres droits de SEGA, cet Accord se terminera automatiquement si vous manquez de vous conformer &#224; ses
    termes et conditions. Au moment de l&#8217;annulation, vous devez d&#233;truire toutes les copies du Produit. Les dispositions des sections 3, 4, 6, 7, 8,
    10, 11 et 12 doivent subsister apr&#232;s l&#8217;annulation du pr&#233;sent Accord.
</p>
<ol type="1" start="12">
    <li>
        <strong>INJONCTION</strong>
    </li>
</ol>
<p>
    <strong> </strong>
</p>
<p>
    Parce que SEGA subirait un pr&#233;judice irr&#233;parable si les termes de cet Accord n&#8217;&#233;taient pas express&#233;ment respect&#233;s, vous
    consentez &#224; ce que SEGA ait droit, sans garantie ou autre s&#251;ret&#233; ni preuve de dommages, de prendre toute mesure jug&#233;e opportune,
    notamment d&#8217;obtenir une injonction ou toute autre r&#233;paration &#233;quitable, en plus des autres r&#233;parations existantes en vertu de la loi
    en vigueur.
</p>
<ol type="1" start="13">
    <li>
        <strong>PROTECTION DES DONN&#201;ES</strong>
    </li>
</ol>
<p>
    <strong> </strong>
</p>
<p>
    LES &#171; DONN&#201;ES PERSONNELLES &#187; D&#201;SIGNENT TOUTE INFORMATION RECUEILLIE, UTILIS&#201;E OU TRAIT&#201;E PAR VOUS DANS LE PRODUIT, CONFORME
    AVEC LE PR&#201;SENT ACCORD ET QUI EST LI&#201;E &#192; UNE PERSONNE VIVANTE POUVANT &#202;TRE IDENTIFI&#201;E GR&#194;CE &#192; CES DONN&#201;ES, OU
    DEPUIS CES DONN&#201;ES ET D'AUTRES INFORMATIONS QUI SONT OU POURRAIENT &#202;TRE EN VOTRE POSSESSION.
</p>
<p>
    VOUS CONSENTEZ &#192; CE QUE SEGA R&#201;CUP&#200;RE OU PUISSE R&#201;CUP&#201;RER DES DONN&#201;ES PROVENANT DE VOS PARTIES JOU&#201;ES ET/OU DE VOTRE
    UTILISATION DES PRODUITS, Y COMPRIS DES DONN&#201;ES PERSONNELLES. PAR EXEMPLE, SEGA PEUT R&#201;CUP&#201;RER OU PRODUIRE DES INFORMATIONS SUR VOTRE
    ORDINATEUR, DONT, LORSQUE CELA EST POSSIBLE, VOTRE ADRESSE IP ET VOTRE SYST&#200;ME D'EXPLOITATION. CE SONT DES DONN&#201;ES STATISTIQUES SUR VOS
    HABITUDES, SANS PORTER ATTEINTE &#192; VOTRE ANONYMAT. LA R&#201;CUP&#201;RATION ET L'ENREGISTREMENT DES INFORMATIONS CI-DESSUS ET DU JEU SONT UNIQUEMENT
    DANS LE BUT DE FACILITER LA FONCTIONNALIT&#201; D&#201;J&#192; EXISTANTE DES PRODUITS, D'AIDER SEGA &#192; &#201;VALUER LES AM&#201;LIORATIONS &#192;
    R&#201;ALISER SUR CE JEU OU D'AUTRES, SELON LES HABITUDES DE JEU G&#201;N&#201;RALES ET DANS DES BUTS DE GESTION NUM&#201;RIQUE.
</p>
<p>
    LE PRODUIT UTILISE UNE BASE DE DONN&#201;ES COMPLEXE, D&#201;TAILL&#201;E ET PR&#201;CISE POUR SIMULER LES PERFORMANCES DE FOOTBALL R&#201;ELLES. LA BASE
    DE DONN&#201;ES COMPREND DES DONN&#201;ES RECUEILLIES AUPR&#200;S, GR&#194;CE &#192;, OU EN REPR&#201;SENTANT DES JOUEURS DE FOOTBALL, DES
    ENTRA&#206;NEURS, STAFF D'ENCADREMENT ET M&#201;DICAL DE LA VIE R&#201;ELLE (&#171; SUJETS DE DONN&#201;ES &#187;) DU MONDE ENTIER. LA BASE DE DONN&#201;ES
    INCLUT LES NOMS COMPLETS DES SUJETS DE DONN&#201;ES AINSI QUE LEURS CARACT&#201;STIQUES, COMPORTEMENTS ET SIMILARIT&#201;S CAR ILS REFL&#200;TENT LA
    CARRI&#200;RE FOOTBALLISTIQUE DES SUJETS DE DONN&#201;ES DANS LE MONDE R&#201;EL. (Vous trouverez de plus amples d&#233;tails au sujet de la politique de
    confidentialit&#233; de SEGA ici : <a href="http://www.sega.co.uk/legal/privacy.php">http://www.sega.co.uk/legal/privacy.php</a>)
</p>
<p>
    EN INSTALLANT, OUVRANT, COPIANT ET/OU UTILISANT CE PRODUIT, VOUS CONC&#201;DEZ PAR LA PR&#201;SENTE QUE VOUS CONSTITUEZ UN PROCESSEUR DE DONN&#201;ES
    &#192; L'&#201;GARD DES DONN&#201;ES DE SUJETS COMME D&#201;FINI DANS LA LOI DE PROTECTION DES DONN&#201;ES (DATA PROTECTION ACT 1998) ou une
    l&#233;gislation &#233;quivalente sur la protection des donn&#233;es. VOUS GARANTISSEZ QUE VOUS APPLIQUEREZ TOUTE OBLIGATION PR&#201;VUE PAR LES LOIS SUR
    LA PROTECTION DES DONN&#201;ES, AINSI QUE LEURS R&#201;GULATIONS ET LES CODES DE CONDUITE QUI SURVIENDRONT AYANT UN RAPPORT AVEC CET ACCORD. VOUS ACCEPTEZ
    DE TRAITER LES DONN&#201;ES PERSONNELLES DANS LA MESURE, ET DE TELLE SORTE, COMME N&#201;CESSAIRE AUX FINS DE CET ACCORD ET VOUS NE TRAITEREZ DE
    DONN&#201;ES PERSONNELLES POUR AUCUN AUTRE BUT ET SUJET QUE CEUX CONTENUS DANS LES RESTRICTIONS DE LA SECTION 4 PR&#201;C&#201;DENTE. VOUS acceptez en
    outre DE VOUS SOUMETTRE PROMPTEMENT &#192; TOUTE REQU&#202;TE DE SEGA VOUS DEMANDANT DE RECTIFIER, TRANSMETTRE OU EFFACER LES DONN&#201;ES PERSONNELLES.
</p>
<p>
    Nous acceptons les commentaires et les questions concernant les donn&#233;es que nous r&#233;cup&#233;rons. Ils doivent &#234;tre adress&#233;s &#224; :
SEGA Europe Limited, 27 Great West Road, Brentford, Middlesex, TW8 9BW, ROYAUME-UNI ou &#224;    <a href="mailto:customersupportuk@sega.co.uk">customersupportuk@sega.co.uk</a>.
</p>
<p>
    <strong> </strong>
</p>
<ol type="1" start="14">
    <li>
        <strong>GARANTIE LIMIT&#201;E DU LOGICIEL DE JEU</strong>
    </li>
</ol>
<p>
    Sous r&#233;serve des limitations mentionn&#233;es ci-dessous, SEGA garantit &#224; l'acheteur original de ce PRODUIT que le fonctionnement dudit PRODUIT
    sera, pour l'essentiel, conforme &#224; la description contenue dans le PRODUIT et/ou son manuel inclus, pour une p&#233;riode de quatre-vingt-dix (90)
    jours &#224; compter de la date du premier achat (LA &#171; GARANTIE &#187;). Cette GARANTIE vous accorde des droits sp&#233;cifiques, auxquels peuvent
    s'ajouter d'autres droits l&#233;gaux ou autres, qui varient selon la juridiction.
</p>
<p>
    Toute utilisation de ce PRODUIT &#224; titre professionnel ou commercial et/ou tout d&#233;faut ou dysfonctionnement r&#233;sultant d&#8217;une faute,
    n&#233;gligence, modification ou d&#8217;un accident, abus, virus, ou usage impropre du PRODUIT, de votre part (ou de la part de toute autre personne
    agissant sous votre contr&#244;le ou votre autorit&#233;), apr&#232;s son achat, rendra cette GARANTIE caduque.
</p>
<p>
    Si, au cours de la p&#233;riode de garantie, vous rencontrez un probl&#232;me avec le PRODUIT (y compris un probl&#232;me d'activation du LOGICIEL de jeu
    via une cl&#233; d'activation ou autre), vous devrez contacter le d&#233;taillant aupr&#232;s duquel vous avez achet&#233; le PRODUIT. Assurez-vous de
    poss&#233;der une copie du justificatif d'achat, qui peut vous &#234;tre demand&#233;e par le d&#233;taillant. Si le PRODUIT ne fonctionne pas
    correctement, veuillez contacter le support technique de SEGA (reportez-vous &#224; la section concern&#233;e dans ce manuel) et fournir une explication
    des difficult&#233;s que vous avez rencontr&#233;es avec le PRODUIT. Le d&#233;taillant ou SEGA aura le choix de r&#233;parer ou de remplacer le PRODUIT.
    Tout PRODUIT de remplacement sera GARANTI soit pour le restant de la p&#233;riode de GARANTIE initiale, soit pendant quatre-vingt-dix (90) jours &#224;
    compter de la date de r&#233;ception du PRODUIT de remplacement, la p&#233;riode la plus longue &#233;tant applicable. Si pour une raison quelconque le
    PRODUIT ne peut &#234;tre ni r&#233;par&#233; ni remplac&#233;, vous aurez droit &#224; recevoir un montant allant jusqu'au prix que vous avez pay&#233;
    pour le PRODUIT. La r&#233;paration, le remplacement ou le prix que vous avez pay&#233; pour le LOGICIEL de jeu sont votre recours exclusif. Pour
    &#233;viter tout doute, LA LIMITATION DE RESPONSABILIT&#201; &#201;TABLIE DANS LA SECTION 7 DE CET ACCORD SERA APPLICABLE &#192; CETTE GARANTIE.
</p>
<ol type="1" start="15">
    <li>
        <strong>LOGICIEL OPEN SOURCE ET LOGICIEL TIERS</strong>
    </li>
</ol>
<p>
    LE LOGICIEL DE JEU COMPREND ET/OU UTILISE DES LOGICIELS OPEN SOURCE ET DES LOGICIELS TIERS. VOUS ACCEPTEZ D'&#202;TRE LI&#201; PAR LES TERMES DE CETTE
    LICENCE EN RESPECT DU LOGICIEL OPEN SOURCE ET/OU TIERS CONTENUS DANS LE LOGICIEL.
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    <strong><u>CppUnit 1.13.2</u></strong>
</p>
<p>
    <strong><em><u> </u></em></strong>
</p>
<p>
    Copyright (C) 2013, Michael Feathers
</p>
<p>
    This program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software
    Foundation, either version 3 of the License, or
</p>
<p>
    (at your option) any later version.
</p>
<p>
    This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS
    FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
</p>
<p>
    You should have received a copy of the GNU General Public License along with this program. If not, see &lt;http://www.gnu.org/licenses/&gt;.
</p>
<p>GNU LESSER GENERAL PUBLIC LICENSE</p>

<p>Version 3, 29 June 2007</p>

<p>Copyright (C) 2007 Free Software Foundation, Inc. &lt;http://fsf.org/&gt;</p>
<p>Everyone is permitted to copy and distribute verbatim copies of this license document, but changing it is not allowed.</p>

<p>This version of the GNU Lesser General Public License incorporates the terms and conditions of version 3 of the GNU General Public License, supplemented by the additional permissions listed below.</p>

<p>0. Additional Definitions.</p>

<p>As used herein, "this License" refers to version 3 of the GNU Lesser General Public License, and the "GNU GPL" refers to version 3 of the GNU General Public License.</p>

<p>"The Library" refers to a covered work governed by this License, other than an Application or a Combined Work as defined below.</p>

<p>An "Application" is any work that makes use of an interface provided by the Library, but which is not otherwise based on the Library. Defining a subclass of a class defined by the Library is deemed a mode of using an interface provided by the Library.</p>

<p>A "Combined Work" is a work produced by combining or linking an Application with the Library.  The particular version of the Library with which the Combined Work was made is also called the "Linked Version".</p>

<p>The "Minimal Corresponding Source" for a Combined Work means the Corresponding Source for the Combined Work, excluding any source code for portions of the Combined Work that, considered in isolation, are based on the Application, and not on the Linked Version.</p>

<p>The "Corresponding Application Code" for a Combined Work means the object code and/or source code for the Application, including any data and utility programs needed for reproducing the Combined Work from the Application, but excluding the System Libraries of the Combined Work.</p>

<p>1. Exception to Section 3 of the GNU GPL.</p>

<p>You may convey a covered work under sections 3 and 4 of this License without being bound by section 3 of the GNU GPL.</p>

<p>2. Conveying Modified Versions.</p>

<p>If you modify a copy of the Library, and, in your modifications, a facility refers to a function or data to be supplied by an Application that uses the facility (other than as an argument passed when the facility is invoked), then you may convey a copy of the modified version:</p>

<p>a) under this License, provided that you make a good faith effort to ensure that, in the event an Application does not supply the function or data, the facility still operates, and performs whatever part of its purpose remains meaningful, or</p>

<p>b) under the GNU GPL, with none of the additional permissions of this License applicable to that copy.</p>

<p>3. Object Code Incorporating Material from Library Header Files.</p>

<p>The object code form of an Application may incorporate material from a header file that is part of the Library.  You may convey such object code under terms of your choice, provided that, if the incorporated material is not limited to numerical parameters, data structure layouts and accessors, or small macros, inline functions and templates (ten or fewer lines in length), you do both of the following:</p>

<p>a) Give prominent notice with each copy of the object code that the Library is used in it and that the Library and its use are covered by this License.</p>

<p>b) Accompany the object code with a copy of the GNU GPL and this license document.</p>

<p>4. Combined Works.</p>

<p>You may convey a Combined Work under terms of your choice that, taken together, effectively do not restrict modification of the portions of the Library contained in the Combined Work and reverse engineering for debugging such modifications, if you also do each of the following:</p>

<p>a) Give prominent notice with each copy of the Combined Work that the Library is used in it and that the Library and its use are covered by this License.</p>

<p>b) Accompany the Combined Work with a copy of the GNU GPL and this license document.</p>

<p>c) For a Combined Work that displays copyright notices during execution, include the copyright notice for the Library among these notices, as well as a reference directing the user to the copies of the GNU GPL and this license document.</p>

<p>d) Do one of the following: </p>

<p>0) Convey the Minimal Corresponding Source under the terms of this License, and the Corresponding Application Code in a form suitable for, and under terms that permit, the user to recombine or relink the Application with a modified version of the Linked Version to produce a modified Combined Work, in the manner specified by section 6 of the GNU GPL for conveying Corresponding Source.</p>

<p>1) Use a suitable shared library mechanism for linking with the Library.  A suitable mechanism is one that (a) uses at run time a copy of the Library already present on the user's computer system, and (b) will operate properly with a modified version of the Library that is interface-compatible with the Linked Version.</p>

<p>e) Provide Installation Information, but only if you would otherwise be required to provide such information under section 6 of the GNU GPL, and only to the extent that such information is necessary to install and execute a modified version of the Combined Work produced by recombining or relinking the Application with a modified version of the Linked Version. (If you use option 4d0, the Installation Information must accompany the Minimal Corresponding Source and Corresponding Application Code. If you use option 4d1, you must provide the Installation Information in the manner specified by section 6 of the GNU GPL for conveying Corresponding Source.)</p>

<p>5. Combined Libraries.</p>

<p>You may place library facilities that are a work based on the Library side by side in a single library together with other library facilities that are not Applications and are not covered by this License, and convey such a combined library under terms of your choice, if you do both of the following:</p>

<p>a) Accompany the combined library with a copy of the same work based  on the Library, uncombined with any other library facilities, conveyed under the terms of this License.</p>

<p>b) Give prominent notice with the combined library that part of it is a work based on the Library, and explaining where to find the accompanying uncombined form of the same work.</p>

<p>6. Revised Versions of the GNU Lesser General Public License.</p>

<p>The Free Software Foundation may publish revised and/or new versions of the GNU Lesser General Public License from time to time. Such new versions will be similar in spirit to the present version, but may differ in detail to address new problems or concerns.</p>

<p>Each version is given a distinguishing version number. If the Library as you received it specifies that a certain numbered version of the GNU Lesser General Public License "or any later version" applies to it, you have the option of following the terms and conditions either of that published version or of any later version published by the Free Software Foundation. If the Library as you received it does not specify a version number of the GNU Lesser General Public License, you may choose any version of the GNU Lesser General Public License ever published by the Free Software Foundation.</p>

<p>If the Library as you received it specifies that a proxy can decide whether future versions of the GNU Lesser General Public License shall apply, that proxy's public statement of acceptance of any version is permanent authorization for you to choose that version for the Library.</p>
<p>
    <strong><u>CRYPTO++ 5.6.3</u></strong>
</p>

<p>Compilation Copyright (c) 1995-2013 by Wei Dai. All rights reserved. This copyright applies only to this software distribution package as a compilation, and does not imply a copyright on any particular file in the package.</p>

<p>All individual files in this compilation are placed in the public domain by Wei Dai and other contributors. The author thanks the following authors for placing their works into the public domain:</p>

<p>Joan Daemen - 3way.cpp</p>
<p>Leonard Janke - cast.cpp, seal.cpp</p>
<p>Steve Reid - cast.cpp</p>
<p>Phil Karn - des.cpp</p>
<p>Andrew M. Kuchling - md2.cpp, md4.cpp</p>
<p>Colin Plumb - md5.cpp</p>
<p>Seal Woods - rc6.cpp</p>
<p>Chris Morgan - rijndael.cpp</p>
<p>Paulo Baretto - rijndael.cpp, skipjack.cpp, square.cpp</p>
<p>Richard De Moliner - safer.cpp</p>
<p>Matthew Skala - twofish.cpp</p>
<p>Kevin Springle - camellia.cpp, shacal2.cpp, ttmac.cpp, whrlpool.cpp, ripemd.cpp</p>
<p>Ronny Van Keer - sha3.cpp</p>

<p>The Crypto++ Library (as a compilation) is currently licensed under the Boost Software License 1.0 (http://www.boost.org/users/license.html).</p>

<p>Boost Software License - Version 1.0 - August 17th, 2003</p>

<p>Permission is hereby granted, free of charge, to any person or organization obtaining a copy of the software and accompanying documentation covered by this license (the "Software") to use, reproduce, display, distribute, execute, and transmit the Software, and to prepare derivative works of the Software, and to permit third-parties to whom the Software is furnished to do so, all subject to the following:</p>

<p>The copyright notices in the Software and this entire statement, including the above license grant, this restriction and the following disclaimer, must be included in all copies of the Software, in whole or in part, and all derivative works of the Software, unless such copies or derivative works are solely in the form of machine-executable object code generated by a source language processor.</p>

<p>THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.</p>

<p>
    <strong><u>EXPAT 2.2.0</u></strong>
</p>
<p>Copyright (c) 1998, 1999, 2000 Thai Open Source Software Center Ltd</p>

<p>Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:</p>

<p>The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.</p>

<p>THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.</p>

<p>
    <strong><u> </u></strong>
</p>
<p>
    <strong><u>FARMHASH</u></strong>
</p>
<p>Copyright (c) 2016 Google Inc.</p>

<p>Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:</p>

<p>The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.</p>

<p>THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.</p>

<p>
    <strong><u>FREETYPE 2.7.1</u></strong>
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    Portions of this software are copyright  2012 The FreeType Project
    (www.freetype.org). All rights reserved.
</p>
<p>
    The FreeType Project LICENSE
</p>
<p>
    ----------------------------
</p>
<p>
    2006-Jan-27
</p>
<p>
    Copyright 1996-2002, 2006 by
</p>
<p>
    David Turner, Robert Wilhelm, and Werner Lemberg
</p>
<p>
    Introduction
</p>
<p>
    ============
</p>
<p>
    The FreeType Project is distributed in several archive packages;
</p>
<p>
    some of them may contain, in addition to the FreeType font engine,
</p>
<p>
    various tools and contributions which rely on, or relate to, the
</p>
<p>
    FreeType Project.
</p>
<p>
    This license applies to all files found in such packages, and
</p>
<p>
    which do not fall under their own explicit license. The license
</p>
<p>
    affects thus the FreeType font engine, the test programs,
</p>
<p>
    documentation and makefiles, at the very least.
</p>
<p>
    This license was inspired by the BSD, Artistic, and IJG
</p>
<p>
    (Independent JPEG Group) licenses, which all encourage inclusion
</p>
<p>
    and use of free software in commercial and freeware products
</p>
<p>
    alike. As a consequence, its main points are that:
</p>
<p>
    o We don't promise that this software works. However, we will be
</p>
<p>
    interested in any kind of bug reports. (`as is' distribution)
</p>
<p>
    o You can use this software for whatever you want, in parts or
</p>
<p>
    full form, without having to pay us. (`royalty-free' usage)
</p>
<p>
    o You may not pretend that you wrote this software. If you use
</p>
<p>
    it, or only parts of it, in a program, you must acknowledge
</p>
<p>
    somewhere in your documentation that you have used the
</p>
<p>
    FreeType code. (`credits')
</p>
<p>
    We specifically permit and encourage the inclusion of this
</p>
<p>
    software, with or without modifications, in commercial products.
</p>
<p>
    We disclaim all warranties covering The FreeType Project and
</p>
<p>
    assume no liability related to The FreeType Project.
</p>
<p>
    Finally, many people asked us for a preferred form for a
</p>
<p>
    credit/disclaimer to use in compliance with this license. We thus
</p>
<p>
    encourage you to use the following text:
</p>
<p>
    """
</p>
<p>
    Portions of this software are copyright  &lt;year&gt; The FreeType
</p>
<p>
    Project (www.freetype.org). All rights reserved.
</p>
<p>
    """
</p>
<p>
    Please replace &lt;year&gt; with the value from the FreeType version you
</p>
<p>
    actually use.
</p>
<p>
    Legal Terms
</p>
<p>
    ===========
</p>
<p>
    0. Definitions
</p>
<p>
    --------------
</p>
<p>
    Throughout this license, the terms `package', `FreeType Project',
</p>
<p>
    and `FreeType archive' refer to the set of files originally
</p>
<p>
    distributed by the authors (David Turner, Robert Wilhelm, and
</p>
<p>
    Werner Lemberg) as the `FreeType Project', be they named as alpha,
</p>
<p>
    beta or final release.
</p>
<p>
    `You' refers to the licensee, or person using the project, where
</p>
<p>
    `using' is a generic term including compiling the project's source
</p>
<p>
    code as well as linking it to form a `program' or `executable'.
</p>
<p>
    This program is referred to as `a program using the FreeType
</p>
<p>
    engine'.
</p>
<p>
    This license applies to all files distributed in the original
</p>
<p>
    FreeType Project, including all source code, binaries and
</p>
<p>
    documentation, unless otherwise stated in the file in its
</p>
<p>
    original, unmodified form as distributed in the original archive.
</p>
<p>
    If you are unsure whether or not a particular file is covered by
</p>
<p>
    this license, you must contact us to verify this.
</p>
<p>
    The FreeType Project is copyright (C) 1996-2000 by David Turner,
</p>
<p>
    Robert Wilhelm, and Werner Lemberg. All rights reserved except as
</p>
<p>
    specified below.
</p>
<p>
    1. No Warranty
</p>
<p>
    --------------
</p>
<p>
    THE FREETYPE PROJECT IS PROVIDED `AS IS' WITHOUT WARRANTY OF ANY
</p>
<p>
    KIND, EITHER EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO,
</p>
<p>
    WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
</p>
<p>
    PURPOSE. IN NO EVENT WILL ANY OF THE AUTHORS OR COPYRIGHT HOLDERS
</p>
<p>
    BE LIABLE FOR ANY DAMAGES CAUSED BY THE USE OR THE INABILITY TO
</p>
<p>
    USE, OF THE FREETYPE PROJECT.
</p>
<p>
    2. Redistribution
</p>
<p>
    -----------------
</p>
<p>
    This license grants a worldwide, royalty-free, perpetual and
</p>
<p>
    irrevocable right and license to use, execute, perform, compile,
</p>
<p>
    display, copy, create derivative works of, distribute and
</p>
<p>
    sublicense the FreeType Project (in both source and object code
</p>
<p>
    forms) and derivative works thereof for any purpose; and to
</p>
<p>
    authorize others to exercise some or all of the rights granted
</p>
<p>
    herein, subject to the following conditions:
</p>
<p>
    o Redistribution of source code must retain this license file
</p>
<p>
    (`FTL.TXT') unaltered; any additions, deletions or changes to
</p>
<p>
    the original files must be clearly indicated in accompanying
</p>
<p>
    documentation. The copyright notices of the unaltered,
</p>
<p>
    original files must be preserved in all copies of source
</p>
<p>
    files.
</p>
<p>
    o Redistribution in binary form must provide a disclaimer that
</p>
<p>
    states that the software is based in part of the work of the
</p>
<p>
    FreeType Team, in the distribution documentation. We also
</p>
<p>
    encourage you to put an URL to the FreeType web page in your
</p>
<p>
    documentation, though this isn't mandatory.
</p>
<p>
    These conditions apply to any software derived from or based on
</p>
<p>
    the FreeType Project, not just the unmodified files. If you use
</p>
<p>
    our work, you must acknowledge us. However, no fee need be paid
</p>
<p>
    to us.
</p>
<p>
    3. Advertising
</p>
<p>
    --------------
</p>
<p>
    Neither the FreeType authors and contributors nor you shall use
</p>
<p>
    the name of the other for commercial, advertising, or promotional
</p>
<p>
    purposes without specific prior written permission.
</p>
<p>
    We suggest, but do not require, that you use one or more of the
</p>
<p>
    following phrases to refer to this software in your documentation
</p>
<p>
    or advertising materials: `FreeType Project', `FreeType Engine',
</p>
<p>
    `FreeType library', or `FreeType Distribution'.
</p>
<p>
    As you have not signed this license, you are not required to
</p>
<p>
    accept it. However, as the FreeType Project is copyrighted
</p>
<p>
    material, only this license, or another one contracted with the
</p>
<p>
    authors, grants you the right to use, distribute, and modify it.
</p>
<p>
    Therefore, by using, distributing, or modifying the FreeType
</p>
<p>
    Project, you indicate that you understand and accept all the terms
</p>
<p>
    of this license.
</p>
<p>
    4. Contacts
</p>
<p>
    -----------
</p>
<p>
    There are two mailing lists related to FreeType:
</p>
<p>
    o freetype@nongnu.org
</p>
<p>
    Discusses general use and applications of FreeType, as well as
</p>
<p>
    future and wanted additions to the library and distribution.
</p>
<p>
    If you are looking for support, start in this list if you
</p>
<p>
    haven't found anything to help you in the documentation.
</p>
<p>
    o freetype-devel@nongnu.org
</p>
<p>
    Discusses bugs, as well as engine internals, design issues,
</p>
<p>
    specific licenses, porting, etc.
</p>
<p>
    Our home page can be found at
</p>
<p>
    http://www.freetype.org
</p>
<p>
    <strong><u>GLEW 1.10.0</u></strong>
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>The OpenGL Extension Wrangler Library</p>

<p>Copyright (C) 2002-2008, Milan Ikits &lt;milan ikits@ieee org&gt;</p>
<p>Copyright (C) 2002-2008, Marcelo E. Magallon &lt;mmagallo@debian org&gt;</p>
<p>Copyright (C) 2002, Lev Povalahev</p>
<p>All rights reserved.</p>

<p>Redistribution and use in source and binary forms, with or without </p>
<p>modification, are permitted provided that the following conditions are met:</p>

<p>* Redistributions of source code must retain the above copyright notice, </p>
<p>  this list of conditions and the following disclaimer.</p>
<p>* Redistributions in binary form must reproduce the above copyright notice, </p>
<p>  this list of conditions and the following disclaimer in the documentation </p>
<p>  and/or other materials provided with the distribution.</p>
<p>* The name of the author may be used to endorse or promote products </p>
<p>  derived from this software without specific prior written permission.</p>

<p>THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSEARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.</p>

<p>
    <strong><u> </u></strong>
</p>
<p>
    <strong><u>GOOGLE BREAKPAD</u></strong>
</p>
<p>Copyright (c) 2016 Google Inc.</p>
<p>
    Redistribution and use in source and binary forms, with or without
    modification, are permitted provided that the following conditions are met:
</p>
<ol start="1" type="1">
    <li>
        Redistributions of source code must retain the above copyright notice,
        this list of conditions and the following disclaimer.
    </li>
</ol>
<ol start="2" type="1">
    <li>
        Redistributions in binary form must reproduce the above copyright
        notice, this list of conditions and the following disclaimer in the
        documentation and/or other materials provided with the distribution.
    </li>
</ol>
<ol start="3" type="1">
    <li>
        Neither the name of the Google nor the names of its contributors may be
        used to endorse or promote products derived from this software without
        specific prior written permission.
    </li>
</ol>
<p>
    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
    AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
    IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
    ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
    LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
    CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
    SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
    INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
    CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
    ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
    POSSIBILITY OF SUCH DAMAGE.
</p>

<p>
    <strong><u> </u></strong>
</p>
<p>
    <strong><u>GOOGLE NOTO FONTS</u></strong>
</p>
<p>Copyright (c) 2016 Google Inc.</p>
<p>
    with Reserved Font Name Noto Sans CJK SC.
</p>
<p>
    with Reserved Font Name Noto Sans CJK TC.
</p>
<p>
    with Reserved Font Name Noto Kufi Arabic.
</p>
<p>
    with Reserved Font Name Noto Sans Hebrew.
</p>
<p>
    with Reserved Font Name Noto Sans CJK JP.
</p>
<p>
    This Font Software is licensed under the SIL Open Font License, Version
    1.1.
</p>
<p>
This license is copied below, and is also available with a FAQ at:    <a href="http://scripts.sil.org/OFL">http://scripts.sil.org/OFL</a>
</p>
<p>
    -----------------------------------------------------------
</p>
<p>
    SIL OPEN FONT LICENSE Version 1.1 - 26 February 2007
</p>
<p>
    -----------------------------------------------------------
</p>
<p>
    PREAMBLE
</p>
<p>
    The goals of the Open Font License (OFL) are to stimulate worldwide
    development of collaborative font projects, to support the font creation
    efforts of academic and linguistic communities, and to provide a free and
    open framework in which fonts may be shared and improved in partnership
    with others.
</p>
<p>
    The OFL allows the licensed fonts to be used, studied, modified and
    redistributed freely as long as they are not sold by themselves. The fonts,
    including any derivative works, can be bundled, embedded, redistributed
    and/or sold with any software provided that any reserved names are not used
    by derivative works. The fonts and derivatives, however, cannot be released
    under any other type of license. The requirement for fonts to remain under
    this license does not apply to any document created using the fonts or
    their derivatives.
</p>
<p>
    DEFINITIONS
</p>
<p>
    "Font Software" refers to the set of files released by the Copyright
    Holder(s) under this license and clearly marked as such. This may include
    source files, build scripts and documentation.
</p>
<p>
    "Reserved Font Name" refers to any names specified as such after the
    copyright statement(s).
</p>
<p>
    "Original Version" refers to the collection of Font Software components as
    distributed by the Copyright Holder(s).
</p>
<p>
    "Modified Version" refers to any derivative made by adding to, deleting, or
    substituting -- in part or in whole -- any of the components of the
    Original Version, by changing formats or by porting the Font Software to a
    new environment.
</p>
<p>
    "Author" refers to any designer, engineer, programmer, technical writer or
    other person who contributed to the Font Software.
</p>
<p>
    PERMISSION &amp; CONDITIONS
</p>
<p>
    Permission is hereby granted, free of charge, to any person obtaining a
    copy of the Font Software, to use, study, copy, merge, embed, modify,
    redistribute, and sell modified and unmodified copies of the Font Software,
    subject to the following conditions:
</p>
<p>
    1) Neither the Font Software nor any of its individual components, in
    Original or Modified Versions, may be sold by itself.
</p>
<p>
    2) Original or Modified Versions of the Font Software may be bundled,
    redistributed and/or sold with any software, provided that each copy
    contains the above copyright notice and this license. These can be included
    either as stand-alone text files, human-readable headers or in the
    appropriate machine-readable metadata fields within text or binary files as
    long as those fields can be easily viewed by the user.
</p>
<p>
    3) No Modified Version of the Font Software may use the Reserved Font
    Name(s) unless explicit written permission is granted by the corresponding
    Copyright Holder. This restriction only applies to the primary font name as
    presented to the users.
</p>
<p>
    4) The name(s) of the Copyright Holder(s) or the Author(s) of the Font
    Software shall not be used to promote, endorse or advertise any Modified
    Version, except to acknowledge the contribution(s) of the Copyright
    Holder(s) and the Author(s) or with their explicit written permission.
</p>
<p>
    5) The Font Software, modified or unmodified, in part or in whole, must be
    distributed entirely under this license, and must not be distributed under
    any other license. The requirement for fonts to remain under this license
    does not apply to any document created using the Font Software.
</p>
<p>
    TERMINATION
</p>
<p>
    This license becomes null and void if any of the above conditions are not
    met.
</p>
<p>
    DISCLAIMER
</p>
<p>
    THE FONT SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
    EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTIES OF
    MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT OF
    COPYRIGHT, PATENT, TRADEMARK, OR OTHER RIGHT. IN NO EVENT SHALL THE
    COPYRIGHT HOLDER BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,
    INCLUDING ANY GENERAL, SPECIAL, INDIRECT, INCIDENTAL, OR CONSEQUENTIAL
    DAMAGES, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
    OUT OF THE USE OR INABILITY TO USE THE FONT SOFTWARE OR FROM OTHER DEALINGS
    IN THE FONT SOFTWARE.<strong><u></u></strong>
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    <strong><u>ICU 59.1</u></strong>
</p>
<p>
    Copyright (c) 1995-2017 International Business Machines Corporation and
    others
</p>
<p>
    All rights reserved.
</p>
<p>
    Permission is hereby granted, free of charge, to any person obtaining a
    copy of this software and associated documentation files (the "Software"),
    to deal in the Software without restriction, including without limitation
    the rights to use, copy, modify, merge, publish, distribute, and/or sell
    copies of the Software, and to permit persons to whom the Software is
    furnished to do so, provided that the above copyright notice(s) and this
    permission notice appear in all copies of the Software and that both the
    above copyright notice(s) and this permission notice appear in supporting
    documentation.
</p>
<p>
    THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT OF THIRD PARTY RIGHTS.
    IN NO EVENT SHALL THE COPYRIGHT HOLDER OR HOLDERS INCLUDED IN THIS NOTICE
    BE LIABLE FOR ANY CLAIM, OR ANY SPECIAL INDIRECT OR CONSEQUENTIAL DAMAGES,
    OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS,
    WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION,
    ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS
    SOFTWARE.
</p>
<p>
    Except as contained in this notice, the name of a copyright holder shall
    not be used in advertising or otherwise to promote the sale, use or other
    dealings in this Software without prior written authorization of the
    copyright holder.
</p>
<div align="center">
    <hr size="2" width="100%" noshade="" align="center"/>
</div>
<p>
    All trademarks and registered trademarks mentioned herein are the property
    of their respective owners.
</p>
<div align="center">
    <hr size="3" width="100%" noshade="" align="center"/>
</div>
<h2>
    Third-Party Software Licenses
</h2>
<p>
    This section contains third-party software notices and/or additional terms
    for licensed third-party software components included within ICU libraries.
</p>
<h3>
    1. Unicode Data Files and Software
</h3>
<p>COPYRIGHT AND PERMISSION NOTICE</p>

<p>Copyright  1991-2017 Unicode, Inc. All rights reserved.</p>
<p>Distributed under the Terms of Use in </p>
<p>http://www.unicode.org/copyright.html.</p>

<p>Permission is hereby granted, free of charge, to any person obtaining</p>
<p>a copy of the Unicode data files and any associated documentation</p>
<p>(the "Data Files") or Unicode software and any associated documentation</p>
<p>(the "Software") to deal in the Data Files or Software</p>
<p>without restriction, including without limitation the rights to use,</p>
<p>copy, modify, merge, publish, distribute, and/or sell copies of</p>
<p>the Data Files or Software, and to permit persons to whom the Data Files or Software are furnished to do so, provided that</p>
<p>(a) this copyright and permission notice appear with all copies </p>
<p>of the Data Files or Software,</p>
<p>(b) this copyright and permission notice appear in associated </p>
<p>documentation, and</p>
<p>(c) there is clear notice in each modified Data File or in the Software</p>
<p>as well as in the documentation associated with the Data File(s) or</p>
<p>Software that the data or software has been modified.</p>

<p>THE DATA FILES AND SOFTWARE ARE PROVIDED "AS IS", WITHOUT WARRANTY OF</p>
<p>ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE</p>
<p>WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND</p>
<p>NONINFRINGEMENT OF THIRD PARTY RIGHTS.</p>
<p>IN NO EVENT SHALL THE COPYRIGHT HOLDER OR HOLDERS INCLUDED IN THIS</p>
<p>NOTICE BE LIABLE FOR ANY CLAIM, OR ANY SPECIAL INDIRECT OR CONSEQUENTIAL DAMAGES, OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR</p>
<p>PERFORMANCE OF THE DATA FILES OR SOFTWARE.</p>

<p>Except as contained in this notice, the name of a copyright holder</p>
<p>shall not be used in advertising or otherwise to promote the sale,</p>
<p>use or other dealings in these Data Files or Software without prior</p>
<p>written authorization of the copyright holder.</p>
<h3>
    2. Chinese/Japanese Word Break Dictionary Data (cjdict.txt)
</h3>
<p>The Google Chrome software developed by Google is licensed under the BSD license. Other software included in this distribution is provided under other licenses, as set forth below.</p>

<p>The BSD License</p>
<p>http://opensource.org/licenses/bsd-license.php </p>
<p>Copyright (C) 2006-2008, Google Inc.</p>
<p>        </p>
<p>All rights reserved.</p>
<p>        </p>
<p>Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:</p>

<p>Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.</p>

<p>Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.</p>

<p>Neither the name of  Google Inc. nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.</p>
<p>        </p>
<p>THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.</p>
<p>                                             </p>
<p>The word list in cjdict.txt are generated by combining three word lists listed below with further processing for compound word breaking. The frequency is generated with an iterative training against Google web corpora. </p>
<p>        </p>
<p>Libtabe (Chinese)</p>
<p>- https://sourceforge.net/project/?group_id=1519</p>
<p>- Its license terms and conditions are shown below.</p>
<p>        </p>
<p>IPADIC (Japanese)</p>
<p>- http://chasen.aist-nara.ac.jp/chasen/distribution.html</p>
<p>- Its license terms and conditions are shown below.</p>
<p>        </p>
<p>---------COPYING.libtabe ---- BEGIN--------------------</p>
<p>        </p>
<p>Copyright (c) 1999 TaBE Project.</p>
<p>Copyright (c) 1999 Pai-Hsiang Hsiao.</p>
<p>All rights reserved.</p>

<p>Redistribution and use in source and binary forms, with or without</p>
<p>modification, are permitted provided that the following conditions</p>
<p>are met:</p>

<p>. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.</p>
<p>. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.</p>
<p>. Neither the name of the TaBE Project nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.</p>

<p>THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.</p>

<p>Copyright (c) 1999 Computer Systems and Communication Lab,</p>
<p>Institute of Information Science, Academia Sinica.</p>
<p>All rights reserved.</p>

<p>Redistribution and use in source and binary forms, with or without</p>
<p>modification, are permitted provided that the following conditions</p>
<p>are met:</p>
<p>. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.</p>
<p>. Redistributions in binary form must reproduce the above copyright</p>
<p>notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.</p>
<p>. Neither the name of the Computer Systems and Communication Lab nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.</p>

<p>THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.</p>

<p>Copyright 1996 Chih-Hao Tsai @ Beckman Institute, University of Illinois</p>
<p>c-tsai4@uiuc.edu  http://casper.beckman.uiuc.edu/~c-tsai4</p>
<p>        </p>
<p>---------------COPYING.libtabe-----END---------------------------------</p>
<p>        </p>
<p>        </p>
<p>---------------COPYING.ipadic-----BEGIN--------------------------------</p>
<p>        </p>
<p>Copyright 2000, 2001, 2002, 2003 Nara Institute of Science and Technology.  All Rights Reserved.</p>

<p>Use, reproduction, and distribution of this software is permitted.</p>
<p>Any copy of this software, whether in its original form or modified, must include both the above copyright notice and the following paragraphs.</p>
<p>        </p>
<p>Nara Institute of Science and Technology (NAIST), the copyright holders, disclaims all warranties with regard to this software, including all implied warranties of merchantability and fitness, in no event shall NAIST be liable for any special, indirect or consequential damages or any damages whatsoever resulting from loss of use, data or profits, whether in an action of contract, negligence or other tortuous action, arising out of or in connection with the use or performance of this software.</p>
<p>        </p>
<p>A large portion of the dictionary entries originate from ICOT Free Software.  The following conditions for ICOT Free Software applies to the current dictionary as well.</p>

<p>Each User may also freely distribute the Program, whether in its original form or modified, to any third party or parties, PROVIDED that the provisions of Section 3 ("NO WARRANTY") will ALWAYS appear on, or be attached to, the Program, which is distributed substantially in the same form as set out herein and that such intended distribution, if actually made, will neither violate or otherwise contravene any of the laws and regulations of the countries having jurisdiction over the User or the intended distribution itself.</p>
<p>        </p>
<p>NO WARRANTY</p>
<p>        </p>
<p>The program was produced on an experimental basis in the course of the research and development conducted during the project and is provided to users as so produced on an experimental basis.  Accordingly, the</p>
<p>program is provided without any warranty whatsoever, whether express,</p>
<p>implied, statutory or otherwise.  The term "warranty" used herein</p>
<p>includes, but is not limited to, any warranty of the quality, performance, merchantability and fitness for a particular purpose of</p>
<p>the program and the nonexistence of any infringement or violation of</p>
<p>any right of any third party.</p>
<p>        </p>
<p>Each user of the program will agree and understand, and be deemed to</p>
<p>have agreed and understood, that there is no warranty whatsoever for</p>
<p>the program and, accordingly, the entire risk arising from or</p>
<p>otherwise connected with the program is assumed by the user.</p>

<p>Therefore, neither ICOT, the copyright holder, or any other organization that participated in or was otherwise related to the</p>
<p>development of the program and their respective officials, directors,</p>
<p>officers and other employees shall be held liable for any and all</p>
<p>damages, including, without limitation, general, special, incidental</p>
<p>and consequential damages, arising out of or otherwise in connection</p>
<p>with the use or inability to use the program or any product, material</p>
<p>or result produced or otherwise obtained by using the program,</p>
<p>regardless of whether they have been advised of, or otherwise had</p>
<p>knowledge of, the possibility of such damages at any time during the</p>
<p>project or thereafter.  Each user will be deemed to have agreed to the</p>
<p>foregoing by his or her commencement of use of the program.  The term</p>
<p>"use" as used herein includes, but is not limited to, the use,</p>
<p>modification, copying and distribution of the program and the</p>
<p>production of secondary products from the program.</p>
<p>        </p>
<p>In the case where the program, whether in its original form or</p>
<p>modified, was distributed or delivered to or received by a user from</p>
<p>any person, organization or entity other than ICOT, unless it makes or</p>
<p>grants independently of ICOT any specific warranty to the user in</p>
<p>writing, such person, organization or entity, will also be exempted</p>
<p>from and not be held liable to the user for any such damages as noted</p>
<p>above as far as the program is concerned.</p>

<p>---------------COPYING.ipadic-----END----------------------------------</p>
<h3>
    3. Lao Word Break Dictionary Data (laodict.txt)
</h3>
<p>Copyright (c) 2013 International Business Machines Corporation</p>
<p>and others. All Rights Reserved.</p>

<p>Project:    http://code.google.com/p/lao-dictionary/</p>
<p>Dictionary: http://lao-dictionary.googlecode.com/git/Lao-Dictionary.txt</p>
<p>License:    http://lao-dictionary.googlecode.com/git/Lao-Dictionary-LICENSE.txt</p>
<p>             (copied below)</p>

<p>This file is derived from the above dictionary, with slight modifications.</p>
<p>-----------------------------------------------------------------------</p>

<p>Copyright (C) 2013 Brian Eugene Wilson, Robert Martin Campbell.</p>
<p>All rights reserved.</p>

<p>Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:</p>

<p>Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.</p>

<p>THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON</p>
<p>ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT</p>
<p>(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.</p>
<p>-----------------------------------------------------------------------</p>
<h3>
    4. Burmese Word Break Dictionary Data (burmesedict.txt)
</h3>
<p>Copyright (c) 2014 International Business Machines Corporation and others. All Rights Reserved.</p>

<p>This list is part of a project hosted at: github.com/kanyawtech/myanmar-karen-word-lists</p>

<p>----------------------------------------------------------------------- </p>

<p>Copyright (c) 2013, LeRoy Benjamin Sharon</p>
<p>All rights reserved.</p>

<p>Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:</p>

<p>Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.</p>

<p>Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.</p>

<p>Neither the name Myanmar Karen Word Lists, nor the names of its</p>
<p>contributors may be used to endorse or promote products derived from</p>
<p>this software without specific prior written permission.</p>

<p>THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT</p>
<p>(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.</p>
<p>-----------------------------------------------------------------------</p>
<h3>
    5. Time Zone Database
</h3>
<p>
ICU uses the public domain data and code derived from    <a href="http://www.iana.org/time-zones">Time Zone Database</a> for its
    time zone support. The ownership of the TZ database is explained in
    <a href="http://tools.ietf.org/html/rfc6557">
        BCP 175: Procedure for Maintaining the Time Zone Database
    </a>
    section 7.
</p>
<p>7.  Database Ownership</p>

<p>The TZ database itself is not an IETF Contribution or an IETF</p>
<p>document.  Rather it is a pre-existing and regularly updated work</p>
<p>that is in the public domain, and is intended to remain in the public</p>
<p>domain.  Therefore, BCPs 78 [RFC5378] and 79 [RFC3979] do not apply</p>
<p>to the TZ Database or contributions that individuals make to it.</p>
<p>Should any claims be made and substantiated against the TZ Database,</p>
<p>the organization that is providing the IANA Considerations defined in</p>
<p>this RFC, under the memorandum of understanding with the IETF,</p>
<p>currently ICANN, may act in accordance with all competent court</p>
<p>orders.  No ownership claims will be made by ICANN or the IETF Trust</p>
<p>on the database or the code.  Any person making a contribution to the</p>
<p>database or code waives all rights to future claims in that</p>
<p>contribution or in the TZ Database.</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    <strong><u>LIBOGG 1.3.2</u></strong>
</p>
<p>
    Copyright (c) 2002, Xiph.org Foundation
</p>
<p>
    Redistribution and use in source and binary forms, with or without
    modification, are permitted provided that the following conditions are met:
</p>
<p>
    - Redistributions of source code must retain the above copyright notice,
    this list of conditions and the following disclaimer.
</p>
<p>
    - Redistributions in binary form must reproduce the above copyright notice,
    this list of conditions and the following disclaimer in the documentation
    and/or other materials provided with the distribution.
</p>
<p>
    - Neither the name of the Xiph.org Foundation nor the names of its
    contributors may be used to endorse or promote products derived from this
    software without specific prior written permission.
</p>
<p>
    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS ``AS
    IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
    THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
    PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS BE
    LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
    CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
    SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
    INTERRUPTION) HOWEVER CAUSED AND ON ANY
</p>
<p>
    THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
    (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
    THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
</p>
<p>
    <strong><u>ImGui (MIT)</u></strong>
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    Copyright (c) 2014 - 2017, Omar Cornut and ImGui contributors
</p>
<p>
    All rights reserved.
</p>
<p>
    Permission to use, copy, modify, and distribute this software for any
    purpose with or without fee is hereby granted, provided that the above
    copyright notice and this permission notice appear in all copies.
</p>
<p>
    THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT OF THIRD PARTY RIGHTS.
    IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,
    DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR
    OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE
    USE OR OTHER DEALINGS IN THE SOFTWARE<strong><u></u></strong>
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    <strong>
        Except as contained in this notice, the name of a copyright holder
        shall not be used in advertising or otherwise to promote the sale, use
        or other dealings in this Software without prior written authorization
        of the copyright holder.
    </strong>
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    <strong><u>Libcurl 7.54</u></strong>
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    Copyright (c) 1996 - 2017, Daniel Stenberg, daniel@haxx.se.
</p>
<p>
    All rights reserved.
</p>
<p>
    Permission to use, copy, modify, and distribute this software for any
    purpose with or without fee is hereby granted, provided that the above
    copyright notice and this permission notice appear in all copies.
</p>
<p>
    THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT OF THIRD PARTY RIGHTS.
    IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,
    DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR
    OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE
    USE OR OTHER DEALINGS IN THE SOFTWARE<strong><u></u></strong>
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    <strong>
        Except as contained in this notice, the name of a copyright holder
        shall not be used in advertising or otherwise to promote the sale, use
        or other dealings in this Software without prior written authorization
        of the copyright holder.
    </strong>
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    <strong><u>LIBSQUISH 1.11</u></strong>
</p>
<p>
    The MIT License (MIT)
</p>
<p>
    Copyright (c) 2013 Simon Brown, Ignacio Castao
</p>
<p>
    Permission is hereby granted, free of charge, to any person obtaining a
    copy
    <br/>
    of this software and associated documentation files (the "Software"), to
    deal
    <br/>
    in the Software without restriction, including without limitation the
    rights
    <br/>
    to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
    <br/>
    copies of the Software, and to permit persons to whom the Software is
    <br/>
    furnished to do so, subject to the following conditions:
</p>
<p>
    The above copyright notice and this permission notice shall be included in
    <br/>
    all copies or substantial portions of the Software.
</p>
<p align="left">
    THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
    AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
    <br/>
    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
    FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
    DEALINGS IN THE SOFTWARE.
</p>
<p>
    <strong><u>LIBTHEORA 1.1.1</u></strong>
</p>
<p>
    <strong></strong>
</p>
<p>
    Copyright (C) 2002-2009 Xiph.org Foundation
</p>
<p>
    Redistribution and use in source and binary forms, with or without
    modification, are permitted provided that the following conditions are met:
</p>
<p>
    - Redistributions of source code must retain the above copyright notice,
    this list of conditions and the following disclaimer.
</p>
<p>
    - Redistributions in binary form must reproduce the above copyright notice,
    this list of conditions and the following disclaimer in the documentation
    and/or other materials provided with the distribution.
</p>
<p>
    - Neither the name of the Xiph.org Foundation nor the names of its
    contributors may be used to endorse or promote products derived from this
    software without specific prior written permission.
</p>
<p>
    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS ``AS
    IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
    THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
    PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS BE
    LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
    CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
    SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
    INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
    CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
    ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
    POSSIBILITY OF SUCH DAMAGE.
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    <strong><u>LIBJPEG-TURBO</u></strong>
</p>
<p>
    This software is based in part on the work of the Independent JPEG Group.
    The Graphics Interchange Format(c) is the Copyright property of CompuServe
    Incorporated. GIF(sm) is a Service Mark property of CompuServe
    Incorporated.
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    <strong><u>LIBPNG 1.6.29</u></strong>
</p>

<p>libpng versions 1.0.7, July 1, 2000 through 1.6.32, August 24, 2017 are Copyright (c) 2000-2002, 2004, 2006-2017 Glenn Randers-Pehrson, are derived from libpng-1.0.6, and are distributed according to the same disclaimer and license as libpng-1.0.6 with the following individuals added to the list of Contributing Authors:</p>

<p>   Simon-Pierre Cadieux</p>
<p>   Eric S. Raymond</p>
<p>   Mans Rullgard</p>
<p>   Cosmin Truta</p>
<p>   Gilles Vollant</p>
<p>   James Yu</p>
<p>   Mandar Sahastrabuddhe</p>
<p>   Google Inc.</p>
<p>   Vadim Barkov</p>

<p>and with the following additions to the disclaimer:</p>

<p>   There is no warranty against interference with your enjoyment of the library or against infringement.  There is no warranty that our efforts or the library will fulfill any of your particular purposes or needs.  This library is provided with all faults, and the entire risk of satisfactory quality, performance, accuracy, and effort is with the user.</p>

<p>Some files in the "contrib" directory and some configure-generated files that are distributed with libpng have other copyright owners and are released under other open source licenses.</p>

<p>libpng versions 0.97, January 1998, through 1.0.6, March 20, 2000, are Copyright (c) 1998-2000 Glenn Randers-Pehrson, are derived from libpng-0.96, and are distributed according to the same disclaimer and license as libpng-0.96, with the following individuals added to the list of Contributing Authors:</p>

<p>   Tom Lane</p>
<p>   Glenn Randers-Pehrson</p>
<p>   Willem van Schaik</p>

<p>libpng versions 0.89, June 1996, through 0.96, May 1997, are Copyright (c) 1996-1997 Andreas Dilger, are derived from libpng-0.88, and are distributed according to the same disclaimer and license as libpng-0.88, with the following individuals added to the list of</p>
<p>Contributing Authors:</p>

<p>   John Bowler</p>
<p>   Kevin Bracey</p>
<p>   Sam Bushell</p>
<p>   Magnus Holmgren</p>
<p>   Greg Roelofs</p>
<p>   Tom Tanner</p>

<p>Some files in the "scripts" directory have other copyright owners but are released under this license.</p>

<p>libpng versions 0.5, May 1995, through 0.88, January 1996, are Copyright (c) 1995-1996 Guy Eric Schalnat, Group 42, Inc.</p>

<p>For the purposes of this copyright and license, "Contributing Authors" is defined as the following set of individuals:</p>

<p>   Andreas Dilger</p>
<p>   Dave Martindale</p>
<p>   Guy Eric Schalnat</p>
<p>   Paul Schmidt</p>
<p>   Tim Wegner</p>

<p>The PNG Reference Library is supplied "AS IS".  The Contributing Authors and Group 42, Inc. disclaim all warranties, expressed or implied, including, without limitation, the warranties of merchantability and of fitness for any purpose.  The Contributing Authors and Group 42, Inc. assume no liability for direct, indirect, incidental, special, exemplary, or consequential damages, which may result from the use of the PNG Reference Library, even if advised of the possibility of such damage.</p>

<p>Permission is hereby granted to use, copy, modify, and distribute this source code, or portions hereof, for any purpose, without fee, subject to the following restrictions:</p>

<p>  1. The origin of this source code must not be misrepresented.</p>

<p>  2. Altered versions must be plainly marked as such and must not</p>
<p>     be misrepresented as being the original source.</p>

<p>  3. This Copyright notice may not be removed or altered from any</p>
<p>     source or altered source distribution.</p>

<p>The Contributing Authors and Group 42, Inc. specifically permit, without fee, and encourage the use of this source code as a component to supporting the PNG file format in commercial products.  If you use this source code in a product, acknowledgment is not required but would be appreciated.</p>

<p>
    <strong><u> </u></strong>
</p>
<p>
    <strong><u>LIBVPX</u></strong>
</p>
<p>Copyright (c) 2016, Google Inc.</p>
<p>
    Redistribution and use in source and binary forms, with or without
    modification, are permitted provided that the following conditions are met:
</p>
<ol start="1" type="1">
    <li>
        Redistributions of source code must retain the above copyright notice,
        this list of conditions and the following disclaimer.
    </li>
</ol>
<ol start="2" type="1">
    <li>
        Redistributions in binary form must reproduce the above copyright
        notice, this list of conditions and the following disclaimer in the
        documentation and/or other materials provided with the distribution.
    </li>
</ol>
<ol start="3" type="1">
    <li>
        Neither the name of the Google nor the names of its contributors may be
        used to endorse or promote products derived from this software without
        specific prior written permission.
    </li>
</ol>
<p>
    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
    AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
    IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
    ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
    LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
    CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
    SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
    INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
    CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
    ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
    POSSIBILITY OF SUCH DAMAGE.
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    <strong><u>LZ4 v. 1.7.5</u></strong>
</p>
<p>
    Copyright (c) 2013 Yann Collet. All rights reserved.
</p>
<p>
    Redistribution and use in source and binary forms, with or without
    modification, are permitted provided that the following conditions are met:
</p>
<ol start="4" type="1">
    <li>
        Redistributions of source code must retain the above copyright notice,
        this list of conditions and the following disclaimer.
    </li>
</ol>
<ol start="5" type="1">
    <li>
        Redistributions in binary form must reproduce the above copyright
        notice, this list of conditions and the following disclaimer in the
        documentation and/or other materials provided with the distribution.
    </li>
</ol>
<ol start="6" type="1">
    <li>
        Neither the name of the &lt;ORGANIZATION&gt; nor the names of its
        contributors may be used to endorse or promote products derived from
        this software without specific prior written permission.
    </li>
</ol>
<p>
    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
    AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
    IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
    ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
    LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
    CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
    SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
    INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
    CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
    ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
    POSSIBILITY OF SUCH DAMAGE.
</p>
<p>
    <strong><u>OPEN AL Soft</u></strong>
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    This program is free software: you can redistribute it and/or modify it
    under the terms of the GNU General Public License as published by the Free
    Software Foundation, either version 3 of the License, or (at your option)
    any later version.
</p>
<p>GNU LESSER GENERAL PUBLIC LICENSE</p>

<p>Version 3, 29 June 2007</p>

<p>Copyright (C) 2007 Free Software Foundation, Inc. <a href="http://fsf.org/">http://fsf.org/</a></p>

<p>Everyone is permitted to copy and distribute verbatim copies of this license document, but changing it is not allowed.</p>

<p>This version of the GNU Lesser General Public License incorporates the terms and conditions of version 3 of the GNU General Public License, supplemented by the additional permissions listed below.</p>

<p>0. Additional Definitions.</p>

<p>As used herein, "this License" refers to version 3 of the GNU Lesser General Public License, and the "GNU GPL" refers to version 3 of the GNU General Public License.</p>

<p>"The Library" refers to a covered work governed by this License, other than an Application or a Combined Work as defined below.</p>

<p>An "Application" is any work that makes use of an interface provided by the Library, but which is not otherwise based on the Library. Defining a subclass of a class defined by the Library is deemed a mode of using an interface provided by the Library.</p>

<p>A "Combined Work" is a work produced by combining or linking an Application with the Library.  The particular version of the Library with which the Combined Work was made is also called the "Linked Version".</p>

<p>The "Minimal Corresponding Source" for a Combined Work means the Corresponding Source for the Combined Work, excluding any source code for portions of the Combined Work that, considered in isolation, are based on the Application, and not on the Linked Version.</p>

<p>The "Corresponding Application Code" for a Combined Work means the object code and/or source code for the Application, including any data and utility programs needed for reproducing the Combined Work from the Application, but excluding the System Libraries of the Combined Work.</p>

<p>1. Exception to Section 3 of the GNU GPL.</p>

<p>You may convey a covered work under sections 3 and 4 of this License without being bound by section 3 of the GNU GPL.</p>

<p>2. Conveying Modified Versions.</p>

<p>If you modify a copy of the Library, and, in your modifications, a facility refers to a function or data to be supplied by an Application that uses the facility (other than as an argument passed when the facility is invoked), then you may convey a copy of the modified version:</p>

<p>a) under this License, provided that you make a good faith effort to ensure that, in the event an Application does not supply the function or data, the facility still operates, and performs whatever part of its purpose remains meaningful, or</p>

<p>b) under the GNU GPL, with none of the additional permissions of this License applicable to that copy.</p>

<p>3. Object Code Incorporating Material from Library Header Files.</p>

<p>The object code form of an Application may incorporate material from a header file that is part of the Library.  You may convey such object code under terms of your choice, provided that, if the incorporated material is not limited to numerical parameters, data structure layouts and accessors, or small macros, inline functions and templates (ten or fewer lines in length), you do both of the following:</p>

<p>a) Give prominent notice with each copy of the object code that the Library is used in it and that the Library and its use are covered by this License.</p>

<p>b) Accompany the object code with a copy of the GNU GPL and this license document.</p>

<p>4. Combined Works.</p>

<p>You may convey a Combined Work under terms of your choice that, taken together, effectively do not restrict modification of the portions of the Library contained in the Combined Work and reverse engineering for debugging such modifications, if you also do each of the following:</p>

<p>a) Give prominent notice with each copy of the Combined Work that the Library is used in it and that the Library and its use are covered by this License.</p>

<p>b) Accompany the Combined Work with a copy of the GNU GPL and this license document.</p>

<p>c) For a Combined Work that displays copyright notices during execution, include the copyright notice for the Library among these notices, as well as a reference directing the user to the copies of the GNU GPL and this license document.</p>

<p>d) Do one of the following: </p>

<p>0) Convey the Minimal Corresponding Source under the terms of this License, and the Corresponding Application Code in a form suitable for, and under terms that permit, the user to recombine or relink the Application with a modified version of the Linked Version to produce a modified Combined Work, in the manner specified by section 6 of the GNU GPL for conveying Corresponding Source.</p>

<p>1) Use a suitable shared library mechanism for linking with the Library.  A suitable mechanism is one that (a) uses at run time a copy of the Library already present on the user's computer system, and (b) will operate properly with a modified version of the Library that is interface-compatible with the Linked Version.</p>

<p>e) Provide Installation Information, but only if you would otherwise be required to provide such information under section 6 of the GNU GPL, and only to the extent that such information is necessary to install and execute a modified version of the Combined Work produced by recombining or relinking the Application with a modified version of the Linked Version. (If you use option 4d0, the Installation Information must accompany the Minimal Corresponding Source and Corresponding Application Code. If you use option 4d1, you must provide the Installation Information in the manner specified by section 6 of the GNU GPL for conveying Corresponding Source.)</p>

<p>5. Combined Libraries.</p>

<p>You may place library facilities that are a work based on the Library side by side in a single library together with other library facilities that are not Applications and are not covered by this License, and convey such a combined library under terms of your choice, if you do both of the following:</p>

<p>a) Accompany the combined library with a copy of the same work based  on the Library, uncombined with any other library facilities, conveyed under the terms of this License.</p>

<p>b) Give prominent notice with the combined library that part of it is a work based on the Library, and explaining where to find the accompanying uncombined form of the same work.</p>

<p>6. Revised Versions of the GNU Lesser General Public License.</p>

<p>The Free Software Foundation may publish revised and/or new versions of the GNU Lesser General Public License from time to time. Such new versions will be similar in spirit to the present version, but may differ in detail to address new problems or concerns.</p>

<p>Each version is given a distinguishing version number. If the Library as you received it specifies that a certain numbered version of the GNU Lesser General Public License "or any later version" applies to it, you have the option of following the terms and conditions either of that published version or of any later version published by the Free Software Foundation. If the Library as you received it does not specify a version number of the GNU Lesser General Public License, you may choose any version of the GNU Lesser General Public License ever published by the Free Software Foundation.</p>

<p>If the Library as you received it specifies that a proxy can decide whether future versions of the GNU Lesser General Public License shall apply, that proxy's public statement of acceptance of any version is permanent authorization for you to choose that version for the Library.</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    <strong><u>OPENCV</u></strong>
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    Redistribution and use in source and binary forms, with or without
    modification, are permitted provided that the following conditions are met:
</p>
<p>
    1. Redistributions of source code must retain the above copyright notice,
    this list of conditions and the following disclaimer.
</p>
<p>
    2. Redistributions in binary form must reproduce the above copyright
    notice, this list of conditions and the following disclaimer in the
    documentation and/or other materials provided with the distribution.
</p>
<p>
    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
    AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
    IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
    ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
    LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
    CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
    SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
    INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
    CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
    ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
    POSSIBILITY OF SUCH DAMAGE.
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    <strong><u>OPEN SSL</u></strong>
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    OpenSSL License
</p>
<p>
    ---------------
</p>
<p>
    /* ====================================================================
</p>
<p>
    * Copyright (c) 1998-2011 The OpenSSL Project. All rights reserved.
</p>
<p>
    *
</p>
<p>
    * Redistribution and use in source and binary forms, with or without
</p>
<p>
    * modification, are permitted provided that the following conditions
</p>
<p>
    * are met:
</p>
<p>
    *
</p>
<p>
    * 1. Redistributions of source code must retain the above copyright
</p>
<p>
    * notice, this list of conditions and the following disclaimer.
</p>
<p>
    *
</p>
<p>
    * 2. Redistributions in binary form must reproduce the above copyright
</p>
<p>
    * notice, this list of conditions and the following disclaimer in
</p>
<p>
    * the documentation and/or other materials provided with the
</p>
<p>
    * distribution.
</p>
<p>
    *
</p>
<p>
    * 3. All advertising materials mentioning features or use of this
</p>
<p>
    * software must display the following acknowledgment:
</p>
<p>
    * "This product includes software developed by the OpenSSL Project
</p>
<p>
    * for use in the OpenSSL Toolkit. (http://www.openssl.org/)"
</p>
<p>
    *
</p>
<p>
    * 4. The names "OpenSSL Toolkit" and "OpenSSL Project" must not be used to
</p>
<p>
    * endorse or promote products derived from this software without
</p>
<p>
    * prior written permission. For written permission, please contact
</p>
<p>
    * openssl-core@openssl.org.
</p>
<p>
    *
</p>
<p>
    * 5. Products derived from this software may not be called "OpenSSL"
</p>
<p>
    * nor may "OpenSSL" appear in their names without prior written
</p>
<p>
    * permission of the OpenSSL Project.
</p>
<p>
    *
</p>
<p>
    * 6. Redistributions of any form whatsoever must retain the following
</p>
<p>
    * acknowledgment:
</p>
<p>
    * "This product includes software developed by the OpenSSL Project
</p>
<p>
    * for use in the OpenSSL Toolkit (http://www.openssl.org/)"
</p>
<p>
    *
</p>
<p>
    * THIS SOFTWARE IS PROVIDED BY THE OpenSSL PROJECT ``AS IS'' AND ANY
</p>
<p>
    * EXPRESSED OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
</p>
<p>
    * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
</p>
<p>
    * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE OpenSSL PROJECT OR
</p>
<p>
    * ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
</p>
<p>
    * SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
</p>
<p>
    * NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
</p>
<p>
    * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
</p>
<p>
    * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
</p>
<p>
    * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
</p>
<p>
    * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
</p>
<p>
    * OF THE POSSIBILITY OF SUCH DAMAGE.
</p>
<p>
    * ====================================================================
</p>
<p>
    *
</p>
<p>
    * This product includes cryptographic software written by Eric Young
</p>
<p>
    * (eay@cryptsoft.com). This product includes software written by Tim
</p>
<p>
    * Hudson (tjh@cryptsoft.com).
</p>
<p>
    *
</p>
<p>
    */
</p>
<p>
    Original SSLeay License
</p>
<p>
    -----------------------
</p>
<p>
    /* Copyright (C) 1995-1998 Eric Young (eay@cryptsoft.com)
</p>
<p>
    * All rights reserved.
</p>
<p>
    *
</p>
<p>
    * This package is an SSL implementation written
</p>
<p>
    * by Eric Young (eay@cryptsoft.com).
</p>
<p>
    * The implementation was written so as to conform with Netscapes SSL.
</p>
<p>
    *
</p>
<p>
    * This library is free for commercial and non-commercial use as long as
</p>
<p>
    * the following conditions are aheared to. The following conditions
</p>
<p>
    * apply to all code found in this distribution, be it the RC4, RSA,
</p>
<p>
    * lhash, DES, etc., code; not just the SSL code. The SSL documentation
</p>
<p>
    * included with this distribution is covered by the same copyright terms
</p>
<p>
    * except that the holder is Tim Hudson (tjh@cryptsoft.com).
</p>
<p>
    *
</p>
<p>
    * Copyright remains Eric Young's, and as such any Copyright notices in
</p>
<p>
    * the code are not to be removed.
</p>
<p>
    * If this package is used in a product, Eric Young should be given
    attribution
</p>
<p>
    * as the author of the parts of the library used.
</p>
<p>
    * This can be in the form of a textual message at program startup or
</p>
<p>
    * in documentation (online or textual) provided with the package.
</p>
<p>
    *
</p>
<p>
    * Redistribution and use in source and binary forms, with or without
</p>
<p>
    * modification, are permitted provided that the following conditions
</p>
<p>
    * are met:
</p>
<p>
    * 1. Redistributions of source code must retain the copyright
</p>
<p>
    * notice, this list of conditions and the following disclaimer.
</p>
<p>
    * 2. Redistributions in binary form must reproduce the above copyright
</p>
<p>
    * notice, this list of conditions and the following disclaimer in the
</p>
<p>
    * documentation and/or other materials provided with the distribution.
</p>
<p>
    * 3. All advertising materials mentioning features or use of this software
</p>
<p>
    * must display the following acknowledgement:
</p>
<p>
    * "This product includes cryptographic software written by
</p>
<p>
    * Eric Young (eay@cryptsoft.com)"
</p>
<p>
    * The word 'cryptographic' can be left out if the rouines from the library
</p>
<p>
    * being used are not cryptographic related :-).
</p>
<p>
    * 4. If you include any Windows specific code (or a derivative thereof)
    from
</p>
<p>
    * the apps directory (application code) you must include an
    acknowledgement:
</p>
<p>
    * "This product includes software written by Tim Hudson
    (tjh@cryptsoft.com)"
</p>
<p>
    *
</p>
<p>
    * THIS SOFTWARE IS PROVIDED BY ERIC YOUNG ``AS IS'' AND
</p>
<p>
    * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
</p>
<p>
    * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
    PURPOSE
</p>
<p>
    * ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
</p>
<p>
    * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
    CONSEQUENTIAL
</p>
<p>
    * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
</p>
<p>
    * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
</p>
<p>
    * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
    STRICT
</p>
<p>
    * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
</p>
<p>
    * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
</p>
<p>
    * SUCH DAMAGE.
</p>
<p>
    *
</p>
<p>
    * The licence and distribution terms for any publically available version
    or
</p>
<p>
    * derivative of this code cannot be changed. i.e. this code cannot simply
    be
</p>
<p>
    * copied and put under another distribution licence
</p>
<p>
    * [including the GNU Public Licence.]
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    <strong><u> </u></strong>
</p>
<p>
    <strong><u>SKIA</u></strong>
</p>
<p>
    Copyright (c) 2017 Google Inc. All rights reserved.
</p>
<p>
    Redistribution and use in source and binary forms, with or without
    modification, are permitted provided that the following conditions are met:
</p>
<p>
    * Redistributions of source code must retain the above copyright notice,
    this list of conditions and the following disclaimer.
</p>
<p>
    * Redistributions in binary form must reproduce the above copyright notice,
    this list of conditions and the following disclaimer in the documentation
    and/or other materials provided with the distribution.
</p>
<p>
    * Neither the name of Google Inc. nor the names of its contributors may be
    used to endorse or promote products derived from this software without
    specific prior written permission.
</p>
<p>
    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
    AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
    IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
    ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
    LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
    CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
    SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
    INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
    CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
    ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
    POSSIBILITY OF SUCH DAMAGE.
</p>
<p>
    <strong><u>ZLIB 1.2.11</u></strong>
</p>
<p>/* zlib.h -- interface of the 'zlib' general purpose compression library version 1.2.11, January 15th, 2017</p>
<p>  Copyright (C) 1995-2017 Jean-loup Gailly and Mark Adler</p>
<p>  This software is provided 'as-is', without any express or implied warranty.  In no event will the authors be held liable for any damages arising from the use of this software.</p>
<p>  Permission is granted to anyone to use this software for any purpose, including commercial applications, and to alter it and redistribute it freely, subject to the following restrictions:</p>
<p>  1. The origin of this software must not be misrepresented; you must not claim that you wrote the original software. If you use this software in a product, an acknowledgment in the product documentation would be appreciated but is not required.</p>
<p>  2. Altered source versions must be plainly marked as such, and must not be misrepresented as being the original software.</p>
<p>  3. This notice may not be removed or altered from any source distribution.</p>
<p>  Jean-loup Gailly        Mark Adler</p>
<p>  jloup@gzip.org          <a href="mailto:madler@alumni.caltech.edu">madler@alumni.caltech.edu</a></p>
<h2 align="left">
    <strong><u>AMD Display Library</u></strong>
</h2>
<h2>
    <strong><u> </u></strong>
</h2>
<h2>
    <strong><u>END USER LICENSE AGREEMENT</u></strong>
</h2>
<p>
    PLEASE READ THIS LICENSE CAREFULLY BEFORE USING THE SOFTWARE. BY USING THE SOFTWARE, YOU ARE AGREEING TO BE BOUND BY THE TERMS OF THIS LICENSE.
</p>
<p>
    1. License. The software accompanying this License (hereinafter &#8220;Software&#8221;), regardless of the media on which it is distributed, are licensed
    to you by Advanced Micro Devices, Inc. (&#8220;AMD&#8221;) for use solely in conjunction with AMD products (&#8220;AMD Products&#8221;). You own the medium
    on which the Software is recorded, but AMD and AMD's Licensors (referred to collectively as &#8220;AMD&#8221;) retain title to the Software and related
    documentation. You may:
</p>
<p>
    a) use the Software solely in conjunction with the AMD Products;
</p>
<p>
    b) you must reproduce on such copy AMD's copyright notice and any other proprietary legends that were on the original copy of the Software;
</p>
<p>
    c) transfer all your license rights in the Software provided you must also transfer a copy of this License, the AMD Products and the related documentation
    and provided the other party reads and agrees to accept the terms and conditions of this License. Upon such transfer your license is then terminated.
</p>
<p>
    2. Restrictions. The Software contains copyrighted and patented material, trade secrets and other proprietary material. In order to protect them, and
    except as permitted by applicable legislation, you may not:
</p>
<p>
    a) decompile, reverse engineer, disassemble or otherwise reduce the Software to a human-perceivable form;
</p>
<p>
    b) modify, network, rent, lend, loan, distribute or create derivative works based upon the Software in whole or in part; or
</p>
<p>
    3. Termination. This License is effective until terminated. You may terminate this License at any time by destroying the Software, related documentation
    and all copies thereof. This License will terminate immediately without notice from AMD if you fail to comply with any provision of this License. Upon
    termination you must destroy the Software, related documentation and all copies thereof.
</p>
<p>
    4. Government End Users. If you are acquiring the Software on behalf of any unit or agency of the United States Government, the following provisions apply.
    The Government agrees the Software and documentation were developed at private expense and are provided with &#8220;RESTRICTED RIGHTS&#8221;. Use,
    duplication, or disclosure by the Government is subject to restrictions as set forth in DFARS 227.7202-1(a) and 227.7202-3(a) (1995), DFARS
    252.227-7013(c)(1)(ii) (Oct 1988), FAR 12.212(a)(1995), FAR 52.227-19, (June 1987) or FAR 52.227-14(ALT III) (June 1987), as amended from time to time. In
    the event that this License, or any part thereof, is deemed inconsistent with the minimum rights identified in the Restricted Rights provisions, the
    minimum rights shall prevail.
</p>
<p>
    5. No Other License. No rights or licenses are granted by AMD under this License, expressly or by implication, with respect to any proprietary information
    or patent, copyright, trade secret or other intellectual property right owned or controlled by AMD, except as expressly provided in this License.
</p>
<p>
    6. Additional Licenses. DISTRIBUTION OR USE OF THE SOFTWARE WITH AN OPERATING SYSTEM MAY REQUIRE ADDITIONAL LICENSES FROM THE OPERATING SYSTEM VENDOR.
</p>
<p>
    7. Disclaimer of Warranty on Software. You expressly acknowledge and agree that use of the Software is at your sole risk. The Software and related
    documentation are provided &#8220;AS IS&#8221; and without warranty of any kind and AMD EXPRESSLY DISCLAIMS ALL WARRANTIES, EXPRESS AND IMPLIED, INCLUDING,
    BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. AMD DOES NOT WARRANT THAT THE FUNCTIONS CONTAINED IN
    THE SOFTWARE WILL MEET YOUR REQUIREMENTS, OR THAT THE OPERATION OF THE SOFTWARE WILL BE UNINTERRUPTED OR ERROR-FREE, OR THAT DEFECTS IN THE SOFTWARE WILL
    BE CORRECTED. THE ENTIRE RISK AS TO THE RESULTS AND PERFORMANCE OF THE SOFTWARE IS ASSUMED BY YOU. FURTHERMORE, AMD DOES NOT WARRANT OR MAKE ANY
    REPRESENTATIONS REGARDING THE USE OR THE RESULTS OF THE USE OF THE SOFTWARE OR RELATED DOCUMENTATION IN TERMS OF THEIR CORRECTNESS, ACCURACY, RELIABILITY,
    CURRENTNESS, OR OTHERWISE. NO ORAL OR WRITTEN INFORMATION OR ADVICE GIVEN BY AMD OR AMD'S AUTHORIZED REPRESENTATIVE SHALL CREATE A WARRANTY OR IN ANY WAY
    INCREASE THE SCOPE OF THIS WARRANTY. SHOULD THE SOFTWARE PROVE DEFECTIVE, YOU (AND NOT AMD OR AMD'S AUTHORIZED REPRESENTATIVE) ASSUME THE ENTIRE COST OF
    ALL NECESSARY SERVICING, REPAIR OR CORRECTION. THE SOFTWARE IS NOT INTENDED FOR USE IN MEDICAL, LIFE SAVING OR LIFE SUSTAINING APPLICATIONS. SOME
    JURISDICTIONS DO NOT ALLOW THE EXCLUSION OF IMPLIED WARRANTIES, SO THE ABOVE EXCLUSION MAY NOT APPLY TO YOU.
</p>
<p>
    8. Limitation of Liability. UNDER NO CIRCUMSTANCES INCLUDING NEGLIGENCE, SHALL AMD, OR ITS DIRECTORS, OFFICERS, EMPLOYEES OR AGENTS, BE LIABLE TO YOU FOR
    ANY INCIDENTAL, INDIRECT, SPECIAL OR CONSEQUENTIAL DAMAGES (INCLUDING DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION, LOSS OF BUSINESS
    INFORMATION, AND THE LIKE) ARISING OUT OF THE USE, MISUSE OR INABILITY TO USE THE SOFTWARE OR RELATED DOCUMENTATION, BREACH OR DEFAULT, INCLUDING THOSE
    ARISING FROM INFRINGEMENT OR ALLEGED INFRINGEMENT OF ANY PATENT, TRADEMARK, COPYRIGHT OR OTHER INTELLECTUAL PROPERTY RIGHT, BY AMD, EVEN IF AMD OR AMD'S
    AUTHORIZED REPRESENTATIVE HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. SOME JURISDICTIONS DO NOT ALLOW THE LIMITATION OR EXCLUSION OF LIABILITY FOR
    INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THE ABOVE LIMITATION OR EXCLUSION MAY NOT APPLY TO YOU. AMD will not be liable for 1)loss of, or damage to, your
    records or data or 2) any damages claimed by you based on any third party claim. In no event shall AMD's total liability to you for all damages, losses,
    and causes of action (whether in contract, tort (including negligence) or otherwise) exceed the amount paid by you for the Software.
</p>
<p>
    <strong>9. Export Restrictions.</strong>
    Recipient shall adhere to all U.S. and other applicable export laws, including but not limited to the U.S. Export Administration Regulations (EAR),
    currently found at 15 C.F.R. Sections 730 through 744. Further, pursuant to 15 C.F.R Section 740.6, Recipient hereby certifies that, except pursuant to a
    license granted by the United States Department of Commerce Bureau of Industry and Security or as otherwise permitted pursuant to a License Exception under
    the U.S. Export Administration Regulations ("EAR"), Recipient will not (1) export, re-export or release to a national of a country in Country Groups D:1 or
    E:2 any restricted technology, software, or source code it receives from AMD, or (2) export to Country Groups D:1 or E:2 the direct product of such
    technology or software, if such foreign produced direct product is subject to national security controls as identified on the Commerce Control List
    (currently found in Supplement 1 to Part 774 of EAR). For the most current Country Group listings, or for additional information about the EAR or
    Recipient&#8217;s obligations under those regulations, please refer to the U.S. Bureau of Industry and Security&#8217;s website at
    <a href="http://mynda-dev.amd.com/NDAOnline/js/fckeditor/editor/%22%22%22%22%22%22%22%22%22%22%22http:/www.bis.doc.gov/%22%22%22%22%22%22%22%22%22%22%22">
        http://www.bis.doc.gov/
    </a>
    . These export requirements shall survive any expiration or termination of this Agreement.
</p>
<p>
    10. Controlling Law and Severability. This Agreement will be governed by and construed under the laws of the State of California without reference to its
    conflicts of law principles. The rights and obligations under this Agreement shall not be governed by the United Nations Convention on Contracts or the
    International Sale of Goods, the application of which is expressly excluded. Each party hereto submits to the jurisdiction of the state and federal courts
    of Santa Clara County and the Northern District of California for the purpose of all legal proceedings arising out of or relating to this Agreement or the
    subject matter hereof. Each party waives any objection which it may have to contest such forum.
</p>
<p>
    11. Complete Agreement. This License constitutes the entire agreement between the parties with respect to the use of the Software and the related
    documentation, and supersedes all prior or contemporaneous understandings or agreements, written or oral, regarding such subject matter. No amendment to or
    modification of this License will be binding unless in writing and signed by a duly authorized representative of AMD.
</p>
<h2 align="left">
    <strong><u>Denuvo</u></strong>
</h2>
<p>
    This Product uses Sony DADC Austria AG&#8217;s Denuvo (&#8220;Denuvo&#8221;) content protection technology. Acceptance of this Agreement and an Internet
    connection are required to verify your license. The technical protection measures of the Product may require you to download certain data to your device in
    order to authenticate the Product. If you disable or otherwise tamper with the technical protection measures, the Product may not operate properly and you
    are in material breach of this Agreement.
</p>
<ol start="16" type="1">
    <li>
        <strong>FONCTIONS PAYANTES</strong>
        <strong></strong>
    </li>
</ol>
<p>
    <strong> </strong>
</p>
<p>
    Ce produit est susceptible d'offrir la possibilit&#233; d'acheter de la monnaie
    virtuelle, utilis&#233;e dans le jeu (<strong>&#171; Monnaie virtuelle &#187;</strong>).
    Le produit est &#233;galement susceptible de pr&#233;voir des objets virtuels
    num&#233;riques utilis&#233;s dans le jeu et/ou d'autres biens et services utilis&#233;s
    dans le jeu (appel&#233;s collectivement, les &#171; <strong>Biens virtuels</strong>
    &#187;). La Monnaie virtuelle et les Biens virtuels peuvent &#226;tre obtenus aupr&#232;s
    de SEGA et/ou de tiers comme suit : (i) obtenus en jouant avec le Produit,
    (ii) achet&#233;s &#224; SEGA en &#233;change d'argent &#171; r&#233;el &#187; si vous &#226;tes l&#233;galement
    majeur dans votre pays de r&#233;sidence, (iii) les Biens virtuels peuvent &#226;tre
    achet&#233;s en utilisant de la Monnaie virtuelle dans certaines circonstances,
    (iv) achet&#233;s &#224; des tiers, tels que des op&#233;rateurs de plateformes marchandes
    de jeux mobiles (comme Google Play pour Android et Apple iTunes Appstore
    pour iOS) en &#233;change d'argent &#171; r&#233;el &#187; si vous &#226;tes l&#233;galement majeur dans
    votre pays de r&#233;sidence, (v) obtenus en &#233;changeant des cr&#233;dits ou d'autres
    objets virtuels sur les sites de tiers, pour autant que cet &#233;change soit
    autoris&#233; par le site web du tiers en question et par SEGA, ou (vi) obtenus
    &#224; travers l'interaction avec ou la participation &#224; certaines publicit&#233;s et
services de tiers (les    <strong>&#171; Modes d'acquisition de la Monnaie virtuelle &#187;</strong>).
</p>
<p>
    Si vous choisissez d'acheter de la Monnaie virtuelle ou des Biens virtuels
    &#224; SEGA ou &#224; ses affili&#233;s, vous acceptez les politiques de tarification, de
    paiement et de facturation s'appliquant &#224; ces frais et charges, tel que
    cela vous est notifi&#233; au moment de l'achat. Les frais ne sont ni
    remboursables ni transf&#233;rables sauf indication expresse contraire dans les
    pr&#233;sentes Conditions. Tous les frais et taxes applicables, le cas &#233;ch&#233;ant,
    doivent &#226;tre pay&#233;s en devise locale, sauf indication contraire au moment de
    l'achat. SEGA n'a aucune visibilit&#233; sur la fa&#231;on dont les tiers exploitent
    leur syst&#232;me de cr&#233;dits ou de Biens virtuels et sur le fait que ces cr&#233;dits
    ou ces biens virtuels puissent ou non &#226;tre &#233;chang&#233;s contre de la Monnaie
    virtuelle. Par cons&#233;quent, ce mode d'obtention de Monnaie virtuelle peut ne
    pas toujours &#226;tre disponible &#224; votre &#233;gard. De plus, Sega n'a aucune
    visibilit&#233; sur les politiques de tarification, de paiement et de
    facturation relatives &#224; ces achats.
</p>
<p>
    Les Biens virtuels et la Monnaie virtuelle sont des objets num&#233;riques sans
    valeur commerciale. SEGA ou toute autre partie ne peuvent en aucun cas
    &#233;changer la Monnaie virtuelle et les Biens virtuels contre de l'argent, des
    biens ou d'autres objets &#171; r&#233;els &#187; ayant une valeur commerciale. Le droit
    dont vous disposez concernant l'utilisation des Biens virtuels et de la
    Monnaie virtuelle se limite &#224; un droit non exclusif, non cessible, non
    sous-licenciable et r&#233;vocable d'utiliser ces Biens virtuels et cette
    Monnaie virtuelle uniquement pour votre divertissement personnel et pour
    une utilisation non commerciale de votre part, en excluant tout autre but.
    Exception faite des droits limit&#233;s d&#233;crits aux pr&#233;sentes, vous ne disposez
    d'aucun int&#233;r&#226;t, droit ou titre de propri&#233;t&#233; sur ces Biens virtuels ou
    cette Monnaie virtuelle, lesquels demeurent la propri&#233;t&#233; exclusive de SEGA.
</p>
<p>
    Sauf autorisation expresse de SEGA, (i) les transferts de Monnaie virtuelle
    ou de Biens virtuels sont strictement interdits ; (ii) vous ne pouvez ni
    acheter ni vendre de la Monnaie virtuelle ou des Biens virtuels en &#233;change
    d'argent &#171; r&#233;el &#187; ou quoi qu'il en soit &#233;changer des objets contre une
    valeur ; et (iii) SEGA ne reconna&#238;t pas les pr&#233;tendus transferts de Monnaie
    virtuelle ou de Biens virtuels, ni les pr&#233;tendus cadeaux, ventes ou n&#233;goces
    dans le &#171; monde r&#233;el &#187; de tout ce qui appara&#238;t dans le Produit. Toute
    tentative d'agir tel que d&#233;crit plus haut constitue une violation des
    conditions du pr&#233;sent Accord et entra&#238;nera automatiquement la suspension de
    vos droits &#224; utiliser la Monnaie virtuelle ou les Biens virtuels, et peut
    entra&#238;ner la fermeture de votre Compte, une interdiction &#224; vie d'utiliser
    le Produit ainsi que les autres produits et services SEGA et/ou une
    &#233;ventuelle action en justice. Vous reconnaissez que toutes les ventes de
    Monnaie et de Biens virtuels sont d&#233;finitives. Aucun remboursement ne sera
    accord&#233;, sauf si SEGA en d&#233;cide autrement, &#224; son enti&#232;re discr&#233;tion.
</p>
<p>
    Tel qu'indiqu&#233; plus haut, l'existence d'une offre sp&#233;cifique de Biens
    virtuels ou de Monnaie virtuelle ne constitue pas un engagement de la part
    de SEGA &#224; maintenir ou &#224; continuer &#224; rendre les Biens virtuels ou la
    Monnaie virtuelle disponibles &#224; l'avenir. La port&#233;e, la vari&#233;t&#233; et le type
    de Biens virtuels et de Monnaie virtuelle que vous &#226;tes susceptible
    d'obtenir peut varier &#224; tout moment. SEGA a le droit absolu de g&#233;rer,
    r&#233;glementer, contr&#244;ler, modifier ou supprimer cette Monnaie virtuelle ou
    ces Biens virtuels comme bon lui semble &#224; son enti&#232;re discr&#233;tion, et la
    responsabilit&#233; de SEGA &#224; votre &#233;gard ou &#224; l'&#233;gard de quiconque au titre de
    l'exercice de ces droits ne saurait &#226;tre engag&#233;e.
</p>
<p>
    <strong> </strong>
</p>
<ol type="1" start="17">
    <li>
        <strong>DIVERS</strong>
    </li>
</ol>
<p>
    Cet accord repr&#233;sente l'accord complet entre vous et SEGA concernant le Produit et remplace tous les accords pr&#233;alables et repr&#233;sentations,
    garanties ou ententes entre SEGA et vous (r&#233;alis&#233;s de mani&#232;re n&#233;gligente ou innoncente mais non frauduleuse) et concernant le m&#234;me
    sujet. SEGA se r&#233;serve le droit de modifier ce Contrat &#224; tout moment, peu importe la mani&#232;re, sans responsabilit&#233; de SEGA et &#224;
    l&#8217;unique discr&#233;tion de SEGA.
</p>
<p>
    Si une partie quelconque de l'Accord est jug&#233;e invalide ou inapplicable conform&#233;ment &#224; la loi en vigueur, y compris, mais sans s'y limiter,
    les exclusions de garantie et les limitations de responsabilit&#233; &#233;nonc&#233;es ci-dessus, alors la disposition invalide ou inapplicable sera
    remplac&#233;e par une disposition valable et ex&#233;cutoire qui correspond le mieux &#224; l'esprit de la disposition originale, et le reste de l'accord
    demeurera en vigueur. Tout manquement de notre part &#224; faire valoir ou exercer toute disposition des droits du contrat ou connexes ne constitue pas une
    renonciation &#224; ce droit ou cette disposition.
</p>
<p>
    SEGA peut c&#233;der le pr&#233;sent Accord, en totalit&#233; ou en partie, &#224; tout moment. Nonobstant, vous ne pouvez pas c&#233;der, transf&#233;rer
    ou sous-licencier tout ou partie de vos droits ou obligations en vertu de l'Accord sans l'autorisation expresse &#233;crite, au pr&#233;alable, de SEGA.
</p>
<p>
    L'application de SEGA de l'accord est sujette aux lois et proc&#233;d&#233;s l&#233;gaux existants et rien dans cet accord ne d&#233;roge au droit de SEGA
    de respecter les ex&#233;cutions gouvernementales, judiciaires et l&#233;gales ou les conditions de votre utilisation du Produit ou les informations
    fournies ou r&#233;cup&#233;r&#233;es par SEGA pour un tel usage. En plus de toute exon&#233;ration pr&#233;vue par le droit en vigueur, nous serons
    exempt&#233;s de responsabilit&#233; en cas de non-livraison ou retard dans la livraison du Produit r&#233;sultant de tout &#233;v&#233;nement
    ind&#233;pendant de notre contr&#244;le raisonnable, pr&#233;visible ou non par les deux parties, y compris mais non limit&#233; &#224;, la perturbation du
    travail, la guerre, le terrorisme, le feu, une attaque par d&#233;ni de service, des pannes d'Internet, un accident, des conditions
    m&#233;t&#233;orologiques d&#233;favorables, l'incapacit&#233; &#224; assurer le transport, un acte gouvernemental ou une r&#233;glementation, et &#224;
    d'autres causes ou &#233;v&#233;nements ind&#233;pendants de notre contr&#244;le raisonnable, que ce soit ou non semblable &#224; ceux qui sont
    &#233;num&#233;r&#233;s ci-dessus.
</p>
<p>
    Rien dans le pr&#233;sent Accord ne donne ou ne pr&#233;tend donner &#224; une tierce partie un avantage ou un droit d'appliquer une disposition du
    pr&#233;sent Accord, ainsi que les dispositions du &#171; Contracts (Rights of Third Parties) Act 1999 &#187; (telles que modifi&#233;es ou amend&#233;es
    de temps &#224; autre) sont express&#233;ment exclues.
</p>
<p>
    Les parties conviennent que toute la correspondance relative au pr&#233;sent Accord doit &#234;tre r&#233;dig&#233;e dans la langue anglaise.
</p>
<p>
    Ce contrat est r&#233;gi par les lois d&#8217;Angleterre et du Pays de Galles, et vous consentez &#224; la comp&#233;tence exclusive des tribunaux anglais.
</p>
<p>
    Vous pouvez contacter SEGA &#224; l&#8217;adresse suivante :
</p>
<p>
    <a name="OLE_LINK5"></a>
    <a name="OLE_LINK6">SEGA Europe Limited</a>
</p>
<p>
    Customer Service Department
</p>
<p>
    27 Great West Road
</p>
<p>
    Brentford
</p>
<p>
    Middlesex
</p>
<p>
    TW8 9BW
</p>
<p>
    Email : <a href="mailto:customersupportuk@sega.co.uk">customersupportuk@sega.co.uk</a>
</p>
<p>
    SAUF MENTION CONTRAIRE, LES NOMS DE SOCI&#201;T&#201;S, LES ORGANISATIONS, LES PRODUITS, LES PERSONNES ET LES &#201;V&#201;NEMENTS D&#201;CRITS DANS CE
    PRODUIT SONT FICTIFS ET TOUTE RESSEMBLANCE &#192; UNE SOCI&#201;T&#201;, UNE ORGANISATION, UN PRODUIT, UNE PERSONNE OU UN &#201;V&#201;NEMENT R&#201;ELS NE
    SERAIT QUE PURE CO&#207;NCIDENCE.
</p>
<p>
    JE RECONNAIS AVOIR LU ET COMPRIS LE CONTRAT DE LICENCE UTILISATEUR FINAL CI-DESSUS ET J&#8217;ACCEPTE QUE MON UTILISATION DU LOGICIEL DE JEU SE FASSE EN
    RECONNAISSANT QUE MON ACCORD EST LI&#201; PAR LE CONTRAT DE LICENCE UTILISATEUR FINAL.
</p>
<br clear="all"/>

</body>
</html>